[
   {
      "nr": 1,
      "pytanie": "Wyjaśnij pojęcie bezrobocia oraz opisz jego rodzaje.",
      "odpowiedz": "Bezrobocie to zjawisko społeczne polegające na tym, że część ludzi zdolnych do pracy i pragnących ją podjąć nie znajduje zatrudnienia.\n\nIstnieje wiele rodzajów bezrobocia, z których najważniejsze to:\n\n* Bezrobocie frykcyjne (przejściowe, fluktuacyjne) - powstaje w wyniku terytorialnego lub zawodowego niedopasowania siły roboczej do popytu, wiąże się ono z ruchliwością pracowników (zmiana miejsca pracy, przechodzeniem na emeryturę).\n* Bezrobocie strukturalne - towarzyszy rozwojowi społeczno-ekonomicznemu, zwłaszcza wprowadzeniu innowacji techniczno-organizacyjnych oszczędzających pracę ludzką.\n* Bezrobocie nieefektywnego popytu - przyczyną jest niedostateczny popyt na pewne dobra.\n* Bezrobocie klasyczne (płacowe) - związane z wymuszaniem przez silne związki zawodowe nadmiernie wysokiego poziomu płac realnych.\n* Bezrobocie ukryte - utożsamiane z przerostami zatrudnienia, które wynikają zarówno z nadmiernego jak i nieracjonalnego zatrudnienia, np. niewykorzystanie czasu pracy itd.\n* Bezrobocie cykliczne (koniunkturalne) - związane z okresowymi spadkami koniunktury gospodarczej będącymi następstwem niedostatecznego popytu na dobra i usługi.\n* Bezrobocie technologiczne (czasem określane jako odmiana bezrobocia strukturalnego) - związane z substytucją pracy żywej przez postęp w technologii, techniki i organizacji pracy.\n* Bezrobocie sezonowe - polega na uzależnieniu rozmiaru bezrobocia od pory roku.\n* Bezrobocie jawne - zarejestrowane w urzędach pracy, dające łatwo się określić.\n\nDodatkowe kryteria podziału bezrobocia:\n\n* Czas trwania:\n    * Krótkookresowe - do 3 miesięcy\n    * Średniookresowe - od 3 do 6 miesięcy\n    * Długookresowe - od 6 do 12 miesięcy\n    * Chroniczne - ponad 12 miesięcy\n* Obszar badań:\n    * Globalne/powszechne (o charakterze międzynarodowym)\n    * Krajowe\n    * Regionalne (najczęściej obszar województwa)\n    * Lokalne\n* Opłacalność podjęcia pracy:\n    * Przymusowe - przy danym poziomie płac realnych byliby w stanie ją podjąć\n    * Dobrowolne - poszukujący pracy podjęliby ją przy wyższym poziomie płac realnych.\n"
   },
   {
      "nr": 2,
      "pytanie": "Wyjaśnij różnice między ekspansywną i restrykcyjną polityką fiskalną.",
      "odpowiedz": "Polityka fiskalna (budżetowa) to decyzje państwa dotyczące wydatków i podatków. Jej celem jest zaspokojenie popytu państwa na pieniądz.\nEkspansywna - pobudzanie gospodarki i wzrostu PKB\nRestrykcyjna - polityka zaciskania pasa\nZwiększenie wydatków rządowych lub/i zmniejszenie podatków (wzrasta dług publiczny)\nZmniejszenie wydatków rządowych lub/i zwiększenie podatków\nZwiększenie podaży pieniądza (obniżenie stopy dyskontowej, zakupy na otwartym rynku, obniżenie poziomu rezerw obowiązkowych)\nZmniejszenie podaży pieniądza (hamuje wzrostową tendencję wywołaną przez mechanizm rynkowy)\nProwadzona w czasie załamania gospodarczego i dna cyklu koniunkturalnego\nProwadzona w fazie ożywienia oraz szczytu cyklu koniunkturalnego\n"
   },
   {
      "nr": 3,
      "pytanie": "Wyjaśnij pojęcie wzrostu gospodarczego oraz wskaż jego źródła w długim okresie.",
      "odpowiedz": "Wzrost gospodarczy oznacza zwiększenie się poziomu realnego PNB (realny produkt narodowy brutto), który jest miarą całkowitego dochodu gospodarki narodowej.\nŚwiadczy on o ilości dóbr i usług, na których zakup może sobie pozwolić gospodarka jako całość.\nŹródła w długim okresie:\n- dostateczna podaż,\n- efektywność czynników wytwórczych,\n- handel zagraniczny,\n- postęp techniczny,\n- dynamika inwestycji.\n"
   },
   {
      "nr": 4,
      "pytanie": "Czym są rynek walutowy i kurs walutowy? Jaką rolę odgrywają w gospodarce?",
      "odpowiedz": "Rynek walutowy to rynek, na którym jedna waluta krajowa może być wymieniona na inną. Kurs walutowy (wymienny) to liczba jednostek waluty obcej, jaką można otrzymać za jednostkę waluty krajowej. Spadek (wzrost) kursu nazywamy deprecjacją (aprecjacją).\nTransakcje te spełniają 3 rodzaje funkcji: zabezpieczająca, spekulacyjna, płatnicza.\nRynek walutowy spełnia w gospodarce szereg istotnych funkcji:\n- porównywalność krajowych cen towarów, usług i instrumentów finansowych z zagranicznymi,\n- przyczynia się do rozwoju handlu zagranicznego poszczególnych krajów,\n- ma wpływ na międzynarodową wymianę handlową poprzez umożliwienie rozliczenia,\n- umożliwia dokonanie transferu siły nabywczej między krajem i zagranicą,\n- umożliwia połączenie krajowego rynku finansowego z międzynarodowym,\n- pozwala na prowadzenie polityki kursowej i monetarnej przez władze monetarne.\n"
   },
   {
      "nr": 5,
      "pytanie": "Wyjaśnij pojęcie produktu krajowego brutto oraz przedstaw jego składniki.",
      "odpowiedz": "Produkt krajowy brutto (PKB) to miara ekonomiczna, która określa wartość wszystkich dóbr i usług wytworzonych w danym kraju w określonym czasie, zazwyczaj rocznym. PKB jest szeroko używanym wskaźnikiem, który pomaga ocenić ogólny rozwój gospodarczy kraju oraz jego zdolność do generowania bogactwa.\n\nSkładniki PKB można podzielić na kilka głównych kategorii:\n\n- Konsumpcja prywatna: Obejmuje to wydatki krajowych gospodarstw domowych na dobra i usługi, takie jak żywność, ubrania, mieszkania, usługi komunalne, zdrowotne, transport oraz rekreacja.\n- Inwestycje: Dotyczy wydatków na inwestycje w kapitał trwały, takie jak zakup maszyn, wyposażenie, budowę nowych fabryk czy infrastrukturę. Inwestycje mogą być prowadzone zarówno przez sektor prywatny, jak i publiczny.\n- Wydatki rządowe: Obejmują wydatki administracji publicznej na cele takie jak edukacja, opieka zdrowotna, infrastruktura, obrona oraz inne programy publiczne.\n- Eksport netto: Różnica między wartością eksportu a importem. Jeśli wartość eksportu jest większa niż import, to mamy do czynienia z dodatnim eksportem netto, co przyczynia się dodatnio do PKB. W przeciwnym razie, gdy import przewyższa eksport, mamy ujemny eksport netto, co obniża PKB.\n\nMatematycznie PKB można wyrazić jako sumę tych składników:\n\nPKB = Konsumpcja prywatna + Inwestycje + Wydatki rządowe + (Eksport - Import)\n\nPKB stanowi ważne narzędzie do analizowania i porównywania gospodarek różnych krajów oraz monitorowania ich wzrostu gospodarczego. Jednakże, warto zauważyć, że PKB ma pewne ograniczenia i nie odzwierciedla pełnego obrazu dobrobytu społecznego czy jakości życia, dlatego używa się również innych wskaźników, takich jak Produkt Krajowy Brutto na mieszkańca, czy Indeks Rozwoju Społecznego.\n"
   },
   {
      "nr": 6,
      "pytanie": "Wymień i opisz etapy kształtowania się zespołu (tzw. cykl życia zespołu).",
      "odpowiedz": "1. Budowa i integracja - zespół dopiero powstaje (dobór odpowiednich osób). Jego członkowie poznają się, budują pozytywne relacje, tworzy się wzajemne zaufanie. Poznanie jasno sprecyzowane cele, zarówno każdego członka, jak i całego zespołu.\n2. Docieranie się - ujawniają się pierwsze różnice w osobowościach i oczekiwaniach poszczególnych osób (konflikty). Jest to zupełnie normalne. Po prawidłowym przejściu tej fazy, członkowie nauczą się akceptować i szanować wzajemne różnice oraz pojawią się pierwsze efekty synergii.\n3. Tworzenie synergii - najlepszy okres w życiu zespołu. Ludzie są zintegrowani i dotarci, zadania podzielone. Wszyscy dążą do wspólnego celu.\n4. Kryzys wieku średniego - pojawiają się pierwsze oznaki zmęczenia i znudzenia, motywacja jest obniżona. Ludzie uważają, że nie rozwijają się, a rutyna powoduje z czasem pierwsze symptomy wypalenia i obniżoną jakość działania.\n5. Odnowa i reintegracja lub równia pochyła - zespół przechodzi przez etap odnowy, gdzie podejmowane są działania mające na celu ponowne zintegrowanie i zmotywowanie członków, lub wchodzi w fazę upadku, gdzie problemy stają się coraz poważniejsze i zespół może się rozpaść.\n"
   },
   {
      "nr": 7,
      "pytanie": "Wymień i opisz warunki konieczne do efektywnego funkcjonowania zespołu.",
      "odpowiedz": "Efektywne funkcjonowanie zespołu zależy od wielu czynników. Oto kilka kluczowych warunków, które są konieczne do tego:\n\n1. Klarowne cele: Zespół musi mieć jasno określone cele, które są zrozumiałe dla wszystkich członków zespołu. Wspólne zrozumienie celów motywuje członków do współpracy i skupienia na osiągnięciu ustalonych rezultatów.\n\n2. Rola i odpowiedzialność: Każdy członek zespołu musi mieć jasno określoną rolę i odpowiedzialność. Klarowność w tym zakresie pomaga uniknąć nieporozumień oraz zapewnia, że każdy wie, czego od niego oczekuje się w ramach zespołu.\n\n3. Komunikacja i otwarta wymiana informacji: Efektywny zespół musi być oparty na otwartej i rzetelnej komunikacji. Członkowie zespołu powinni czuć się swobodnie w dzieleniu się swoimi myślami, pomysłami i obawami. Regularne spotkania i dostępność do informacji są kluczowe dla tego procesu.\n\n4. Zaufanie i szacunek: Zespół musi budować zaufanie i szacunek między członkami. Gdy członkowie zespołu ufają sobie nawzajem, łatwiej jest podejmować ryzyko, rozwiązywać konflikty i pracować wspólnie w trudnych sytuacjach.\n\n5. Różnorodność kompetencji i perspektyw: Efektywny zespół powinien składać się z osób o różnych umiejętnościach, doświadczeniach i perspektywach. Różnorodność ta pozwala zespołowi podejmować bardziej kreatywne i skuteczne decyzje, a także lepiej reprezentować różnorodne grupy interesów.\n\n6. Dobrze zdefiniowane procesy pracy: Zespół potrzebuje dobrze zdefiniowanych procesów pracy, które pomagają w organizacji zadań, podejmowaniu decyzji i monitorowaniu postępów. Jasne procedury i role ułatwiają efektywne zarządzanie projektem i zapobiegają chaosowi.\n\n7. Skuteczne zarządzanie konfliktami: Konflikty są nieuniknione w każdym zespole, ale ważne jest, aby zespół potrafił je konstruktywnie rozwiązywać. Skuteczne zarządzanie konfliktami obejmuje otwartą komunikację, empatię, zdolność do wysłuchania i wspólnego poszukiwania rozwiązań.\n\n8. Motywacja i zaangażowanie: Członkowie zespołu powinni być motywowani do osiągania wspólnych celów i zaangażowani w swoją pracę. Wsparcie ze strony lidera zespołu, możliwość rozwoju osobistego oraz docenianie osiągnięć są kluczowe dla utrzymania wysokiego poziomu motywacji i zaangażowania.\n"
   },
   {
      "nr": 8,
      "pytanie": "Podaj korzyści i słabości wynikające z pracy w zespole.",
      "odpowiedz": "Korzyści pracy w zespole:\n\n1. Zwiększona efektywność: Dzięki współpracy i podziale obowiązków zespół może osiągnąć cele szybciej i bardziej skutecznie niż jednostka pracująca samodzielnie.\n\n2. Różnorodność perspektyw: Zespoły składające się z różnorodnych osób mogą generować bardziej kreatywne pomysły i rozwiązania problemów poprzez połączenie różnych punktów widzenia i doświadczeń.\n\n3. Wzajemne wsparcie: Członkowie zespołu mogą wzajemnie wspierać się w trudnych sytuacjach, dzielić wiedzą i umiejętnościami oraz motywować się nawzajem.\n\n4. Rozwój umiejętności interpersonalnych: Praca w zespole może pomóc w rozwoju umiejętności interpersonalnych, takich jak komunikacja, negocjacje, zarządzanie konfliktami czy budowanie zaufania.\n\n5. Podział ryzyka: Dzięki współpracy w zespole, ryzyko związane z realizacją projektu lub zadania może być lepiej rozłożone między różnych członków, co zmniejsza presję na jednostkę.\n\nSłabości pracy w zespole:\n\n1. Konflikty interpersonalne: Różnice w punktach widzenia, osobowościach i stylach pracy mogą prowadzić do konfliktów w zespole, co może negatywnie wpływać na atmosferę i efektywność pracy.\n\n2. Decyzyjne opóźnienia: Proces podejmowania decyzji w zespole może być czasochłonny, zwłaszcza gdy istnieją różne opinie i perspektywy, co może opóźniać postęp prac.\n\n3. Brak indywidualnej odpowiedzialności: W niektórych przypadkach praca w zespole może prowadzić do utraty indywidualnej odpowiedzialności, co może obniżyć motywację jednostki do wykonywania swoich obowiązków.\n\n4. Dominacja jednostki: W niektórych zespołach jedna lub kilka osób może dominować nad resztą, co może prowadzić do poczucia wykluczenia innych członków zespołu oraz utrudniać współpracę.\n\n5. Zmniejszenie innowacyjności: Zbyt silna presja na konsensus i zgodność w zespole może ograniczać innowacyjność i kreatywność, ponieważ może to prowadzić do unikania ryzyka i utrzymywania status quo.\n"
   },
   {
      "nr": 9,
      "pytanie": "Określ pojęcie marketingu międzynarodowego.",
      "odpowiedz": "Marketing międzynarodowy to dział marketingu, który koncentruje się na promocji i sprzedaży produktów lub usług na rynkach zagranicznych. Obejmuje strategie i techniki, które firma stosuje w celu dotarcia do klientów poza swoim krajem pochodzenia. Marketing międzynarodowy uwzględnia różnice kulturowe, językowe, ekonomiczne, polityczne i prawne między różnymi krajami, aby skutecznie dostosować swoje działania do lokalnych warunków.\n\nPodstawowe zadania marketingu międzynarodowego obejmują:\n\n1. Badanie rynku: Analiza rynków zagranicznych w celu zrozumienia preferencji klientów, konkurencji, trendów rynkowych oraz czynników kulturowych i społecznych.\n\n2. Segmentacja rynku: Dzielenie rynków zagranicznych na segmenty o podobnych potrzebach, preferencjach i charakterystykach demograficznych w celu lepszego dopasowania oferty do potrzeb klientów.\n\n3. Pozycjonowanie marki: Tworzenie i promowanie unikalnego wizerunku marki na rynkach międzynarodowych, który wyróżnia ją spośród konkurencji i przyciąga klientów.\n\n4. Promocja i reklama: Opracowywanie kampanii promocyjnych, reklamowych i działań PR dostosowanych do lokalnych realiów kulturowych i językowych.\n\n5. Dystrybucja: Wybór odpowiednich kanałów dystrybucji, takich jak sprzedaż bezpośrednia, dystrybucja przez pośredników, e-commerce, które umożliwiają skuteczną dostawę produktów do klientów zagranicznych.\n\n6. Cena: Określanie strategii cenowej, uwzględniającej konkurencję, koszty transportu, cła, podatki oraz różnice w poziomie życia i siły nabywczej na rynkach międzynarodowych.\n"
   },
   {
      "nr": 10,
      "pytanie": "Przyczyny internacjonalizacji przedsiębiorstw.",
      "odpowiedz": "Internacjonalizacja przedsiębiorstw, czyli ich ekspansja na międzynarodowe rynki, może mieć wiele przyczyn. Oto kilka głównych:\n\n1. Dostęp do nowych rynków: Przedsiębiorstwa internacjonalizują się, aby uzyskać dostęp do nowych rynków i klientów. Rozszerzenie działalności poza granice krajowe może być kluczowe dla zwiększenia sprzedaży i zróżnicowania portfela klientów.\n\n2. Wzrost konkurencyjności: Internacjonalizacja może zwiększyć konkurencyjność przedsiębiorstwa poprzez wykorzystanie korzyści skali, zróżnicowania ryzyka oraz zdobycie przewagi konkurencyjnej na nowych rynkach.\n\n3. Dostęp do zasobów: Przedsiębiorstwa mogą internacjonalizować się, aby uzyskać dostęp do nowych źródeł surowców, technologii, wiedzy, kapitału ludzkiego czy nowych technologii.\n\n4. Optymalizacja kosztów produkcji: Czasami internacjonalizacja pozwala przedsiębiorstwom na zminimalizowanie kosztów produkcji poprzez przeniesienie produkcji do regionów o niższych kosztach pracy lub korzystanie z korzyści skali w globalnych sieciach dostaw.\n\n5. Unikanie ograniczeń rynkowych: Internacjonalizacja może być reakcją na ograniczenia na rynku krajowym, takie jak nasycenie rynku, regulacje, polityka fiskalna czy handlowa.\n"
   },
   {
      "nr": 11,
      "pytanie": "Przedstaw analizę PEST.",
      "odpowiedz": "Analiza PEST (generalna segmentacja otoczenia) jest metodą służącą do badania makrootoczenia.\nOkreśla podstawowe sfery (obszary) mające kluczowy wpływ na funkcjonowanie organizacji:\n\nCzynniki polityczno – prawne (POLITICAL):\n- Ustawodawstwo antymonopolowe,\n- Przepisy o ochronie środowiska,\n- Polityka podatkowa,\n- Przepisy dotyczące handlu zagranicznego,\n- Prawo pracy,\n- Stabilność władzy.\n\nCzynniki ekonomiczne (ECONOMIC):\n- Cykle koniunktury gospodarczej,\n- Tendencje w zakresie PKB,\n- Stopy procentowe,\n- Podaż pieniądza,\n- Inflacja,\n- Bezrobocie,\n- Dostępność i koszt nośników energii,\n- Kursy walut,\n- Rentowność przedsiębiorstw.\n\nCzynniki społeczno – kulturowe (SOCIAL):\n- Demografia ludności,\n- Rozłożenie dochodów,\n- Normy etyczne i moralne,\n- Zmiany stylu życia,\n- Konsumpcyjny styl życia,\n- Poziom wykształcenia.\n\nCzynniki technologiczne (TECHNOLOGICAL):\n- Wydatki państwa na badania i rozwój,\n- Poziom technologiczny kluczowych sektorów,\n- Innowacyjność technologiczna,\n- Szybkość transferu technologii.\n\nPoprzez dogłębną analizę wyznacza przyszłą strategię działania organizacji."
   },
   {
      "nr": 12,
      "pytanie": "Finansowe czynniki wartości przedsiębiorstwa.",
      "odpowiedz": "Wartość przedsiębiorstwa jest wynikiem wielu czynników, z których wiele ma bezpośredni związek z jego sytuacją finansową.\n\n1. Przychody: Stabilne i rosnące przychody są istotnym czynnikiem wpływającym na wartość przedsiębiorstwa. Wyższe przychody zazwyczaj oznaczają większy potencjał generowania przyszłych zysków.\n\n2. Zysk netto: Zysk netto to różnica między przychodami a kosztami operacyjnymi oraz podatkami. Wyższy zysk netto zazwyczaj oznacza większą wartość przedsiębiorstwa, ponieważ odzwierciedla on zdolność firmy do generowania zysków.\n\n3. Dochód operacyjny: Dochód operacyjny to zysk przed opodatkowaniem oraz odsetkami i amortyzacją (EBITDA). Wyższy dochód operacyjny świadczy o efektywnym wykorzystaniu zasobów firmy i może dodatkowo podnosić jej wartość.\n\n4. Dług i zadłużenie: Poziom zadłużenia ma istotny wpływ na wartość przedsiębiorstwa. Wysokie zadłużenie może zwiększać ryzyko finansowe i obniżać wartość firmy ze względu na koszty obsługi długu oraz ograniczenia finansowe.\n\n5. Płynność finansowa: Wysoki poziom płynności finansowej, czyli dostępność gotówki i aktywów łatwo zamienialnych na płynne środki pieniężne, może dodatkowo podnosić wartość przedsiębiorstwa, zapewniając stabilność finansową i zdolność do realizacji inwestycji.\n\n6. Wartość rynkowa akcji: Wartość rynkowa akcji przedsiębiorstwa na giełdzie lub w transakcjach prywatnych może być ważnym wskaźnikiem wartości firmy, ponieważ odzwierciedla postrzeganie jej przez inwestorów.\n\n7. Aktywa i zobowiązania: Skład aktywów i zobowiązań, w tym ich jakość i stopień zabezpieczenia, również mogą wpływać na wartość przedsiębiorstwa. Bogatsza i lepiej zabezpieczona baza aktywów może podnosić wartość firmy.\n\n8. Prognozy przyszłych przepływów pieniężnych: Oczekiwane przyszłe przepływy pieniężne są kluczowym czynnikiem, który inwestorzy biorą pod uwagę przy ocenie wartości przedsiębiorstwa. Prognozy te uwzględniają m.in. wzrost przychodów, zmiany kosztów i inwestycje przyszłościowe."
   },
   {
      "nr": 13,
      "pytanie": "Cele analizy strategicznej przedsiębiorstwa.",
      "odpowiedz": "1. Identyfikacja szans i zagrożeń generowanych przez otoczenie w kontekście dalszego rozwoju firmy.\n2. Identyfikacja silnych i słabych stron pod kątem możliwości budowania przewagi konkurencyjnej.\n3. Konfrontacja (bilans) szans i zagrożeń tkwiących w otoczeniu oraz silnych i słabych stron przedsiębiorstwa w celu zdefiniowania wariantów strategii rozwoju, a w konsekwencji planów i programów strategii zarządzania.\n4. Możliwe wczesne wykrycie nieprawidłowości w funkcjonowaniu samego przedsiębiorstwa oraz ich przyczyn.\n5. Samookreślenie przedsiębiorstwa i ustalenie jego miejsca na rynku w relacji do głównych konkurentów (ocena tożsamości i wizerunek firmy).\n6. Ogólna ocena ryzyka związanego z prowadzeniem poszczególnych rodzajów działalności; określenie możliwości tworzenia wartości dodanej dla klientów i innych interesariuszy."
   },
   {
      "nr": 14,
      "pytanie": "Cechy strategii w ujęciu szkoły planistycznej.",
      "odpowiedz": "Szkoła planistyczna to jedna z głównych szkół myślenia w teorii strategii, której koncepcja opiera się na planowaniu długoterminowej strategii przedsiębiorstwa. Oto główne cechy strategii w ujęciu szkoły planistycznej:\n\nSystematyczność: Strategia według podejścia planistycznego jest tworzona w sposób systematyczny i zorganizowany. Proces ten zazwyczaj obejmuje analizę środowiska zewnętrznego i wewnętrznego, ustalenie celów, formułowanie strategii oraz określenie działań niezbędnych do ich osiągnięcia.\nZorientowanie na przyszłość: Szkoła planistyczna kładzie duży nacisk na analizę i przewidywanie przyszłych trendów, możliwości i zagrożeń, aby umożliwić przedsiębiorstwu odpowiednie dostosowanie się do zmieniających się warunków.\nDługoterminowość: Strategia według tej szkoły koncentruje się na długoterminowym rozwoju przedsiębiorstwa. Zakłada się, że planowane decyzje strategiczne mają być realizowane w perspektywie wielu lat i mają prowadzić do osiągnięcia długoterminowych celów.\nTop-down: Proces tworzenia strategii w szkole planistycznej jest zazwyczaj top-down, co oznacza, że decyzje strategiczne są podejmowane przez najwyższe szczeble zarządzania i następnie komunikowane w dół hierarchii organizacyjnej.\nCentralizacja decyzji: Decyzje strategiczne w szkole planistycznej są zazwyczaj centralizowane i podejmowane przez niewielką grupę menedżerów lub kierownictwo przedsiębiorstwa. Działania te mają być spójne i zgodne z wytyczonymi celami i strategią.\nSformalizowanie procesu: Proces tworzenia strategii w szkole planistycznej jest często sformalizowany i składa się z określonych etapów oraz metodologii. Wymaga to stosowania narzędzi i technik analizy, planowania i oceny strategicznej.\nKontrola wykonania: Istotnym elementem strategii według podejścia planistycznego jest monitorowanie i kontrola wykonania ustalonych planów strategicznych. Ma to zapewnić, że przedsiębiorstwo realizuje założone cele zgodnie z przyjętą strategią.\nZłożoność i rygorystyczność: Proces tworzenia strategii w szkole planistycznej może być złożony i rygorystyczny, wymagając wielu analiz, prognoz i ocen, aby zapewnić odpowiednie fundamenty dla podejmowanych decyzji strategicznych.\n"
   },
   {
      "nr": 15,
      "pytanie": "Główne założenia ewolucyjnej szkoły zarządzania strategicznego.",
      "odpowiedz": "Ewolucyjna szkoła zarządzania strategicznego podkreśla stopniowy, adaptacyjny charakter procesu strategii, zakładając, że strategie kształtują się w wyniku interakcji między organizacją a jej otoczeniem. Oto główne założenia ewolucyjnej szkoły zarządzania strategicznego:\n\n1. Procesy adaptacyjne: Według tej szkoły, proces zarządzania strategicznego jest procesem adaptacyjnym, w którym organizacja reaguje na zmiany w otoczeniu poprzez stopniową adaptację swoich działań i strategii.\n\n2. Brak jednoznaczności: W przeciwieństwie do innych szkół, ewolucyjna szkoła nie zakłada jednoznacznej, planowej strategii. W procesie zarządzania strategicznego istnieje wiele możliwych ścieżek rozwoju, a strategie kształtują się stopniowo w wyniku prób i błędów.\n\n3. Dopasowanie do otoczenia: Organizacja przystosowuje się do zmieniających się warunków otoczenia poprzez adaptację swoich działań i strategii. Sukces organizacji zależy od jej zdolności do elastycznego reagowania na zmiany i wykorzystywania pojawiających się możliwości.\n\n4. Dziedziczenie wariantów: Proces ewolucji strategii polega na dziedziczeniu i modyfikowaniu różnych wariantów strategii w miarę ich sukcesu lub porażki w zastosowaniu. Te warianty są tworzone i rozwijane w organizacji na podstawie doświadczeń i prób działania.\n\n5. Nieświadomość działań: Organizacje mogą działać na podstawie ograniczonych informacji i świadomości, a wiele działań i strategii może wynikać z nieświadomych procesów i mechanizmów.\n\n6. Znaczenie historii: Historia organizacji, w tym jej doświadczenia, kultura, wartości i tradycje, ma wpływ na kształtowanie się strategii. To, co organizacja robiła w przeszłości, ma wpływ na jej obecne działania i podejmowane decyzje.\n\n7. Złożoność procesu: Proces ewolucji strategii jest złożony i niejednoznaczny, co oznacza, że nie można go precyzyjnie kontrolować ani przewidzieć. Organizacje muszą być elastyczne i otwarte na zmiany, aby skutecznie zarządzać swoją strategią.\n\nPodsumowując, ewolucyjna szkoła zarządzania strategicznego podkreśla adaptacyjny charakter procesu strategii, opierając się na stopniowej adaptacji organizacji do zmieniających się warunków otoczenia oraz na działaniu na podstawie doświadczeń i dziedziczenia różnych wariantów strategii.\n"
   },
   {
      "nr": 16,
      "pytanie": "Jakie główne decyzje składają się na treść strategii rozwoju przedsiębiorstwa.",
      "odpowiedz": "Decyzje składające się na treść strategii rozwoju przedsiębiorstwa dotyczą:\n-typu strategii (przyjęty model zachowania strategicznego firmy),\n-obsługiwanych klientów i rynków, na których firma zamierza działać w planowanym okresie,\n-zaspokajania potrzeb i korzyści (wartości) jakie firma planuje dostarczyć odbiorcom,\n-reguł alokacji potencjału, którym dysponuje oraz który zamierza pozyskać w rezultacie wdrożenia strategii, w tym wyboru kierunków inwestowania, pozyskiwania zasobów, likwidacji działalności niedochodowych oraz podziału wypracowanych efektów,\n-zasad działania, związanych z uruchomieniem i wykonywaniem zleceń i działalności podstawowej, realizacją działalności B+R, procesów pomocniczych, obsługowych oraz kierowania firmą,\n-reguł współpracy z otoczeniem (wybór strategicznych partnerów, określenia konkurentów),\n-planowanych zachowań w sytuacjach kryzysowych."
   },
   {
      "nr": 17,
      "pytanie": "Charakterystyka rynku pieniężnego.",
      "odpowiedz": "Rynek pieniężny to segment rynku finansowego, na którym instytucje i inwestorzy dokonują krótkoterminowych transakcji instrumentami finansowymi o bardzo wysokiej płynności i niskim ryzyku. Charakteryzuje się on krótkim terminem zapadalności instrumentów finansowych oraz niskimi stopami zwrotu w porównaniu z innymi segmentami rynku finansowego. Oto kilka głównych cech rynku pieniężnego:\n\nWysoka płynność: Rynek pieniężny cechuje się dużą płynnością, co oznacza, że instrumenty finansowe mogą być łatwo kupowane i sprzedawane bez większego wpływu na ich cenę. To sprawia, że rynek ten jest atrakcyjny dla inwestorów, którzy potrzebują szybkiego dostępu do gotówki.\nKrótkoterminowa zapadalność: Instrumenty finansowe notowane na rynku pieniężnym mają zazwyczaj bardzo krótki termin zapadalności, zazwyczaj od jednego dnia do jednego roku. Są to na przykład obligacje skarbowe o krótkim terminie zapadalności, obligacje komercyjne, papiery wartościowe rynku pieniężnego (PVRP) oraz depozyty terminowe.\nNiskie ryzyko: Instrumenty finansowe notowane na rynku pieniężnym zazwyczaj charakteryzują się niskim ryzykiem inwestycyjnym w porównaniu z innymi instrumentami finansowymi. Są one uważane za bezpieczne ze względu na krótki okres zapadalności i solidność emitentów, takich jak rządy centralne, banki o wysokim ratingu kredytowym czy korporacje z dobrym profilem kredytowym.\nInstrumenty o stałym oprocentowaniu: Wiele instrumentów finansowych notowanych na rynku pieniężnym oferuje stałe oprocentowanie, które jest znane przed dokonaniem inwestycji. Oprocentowanie to zazwyczaj jest niższe w porównaniu z instrumentami dłużnymi, ale stanowi pewne źródło przychodów dla inwestorów.\nRola banków centralnych: Banki centralne często działają jako regulatorzy i uczestnicy rynku pieniężnego poprzez prowadzenie operacji otwartego rynku, kontrolę stóp procentowych oraz zapewnianie płynności na rynku poprzez operacje refinansowania.\nInstrumenty rynku międzybankowego: Rynek pieniężny obejmuje również rynek międzybankowy, na którym banki dokonują transakcji między sobą, wymieniając się płynnościami i kredytami na krótki okres.\nStała kontrola nad ryzykiem: Ze względu na niskie ryzyko i krótkoterminowy charakter instrumentów finansowych, inwestorzy na rynku pieniężnym zazwyczaj utrzymują stałą kontrolę nad ryzykiem, starając się unikać zbyt dużych ekspozycji na ryzyko inwestycyjne.\n"
   },
   {
      "nr": 18,
      "pytanie": "Instrumenty wierzytelnościowe (dłużne) rynku kapitałowego.",
      "odpowiedz": "Rynek kapitałowy- segment rynku finansowego, na którym są zawierane transakcje średnio i długoterminowymi instrumentami finansowymi. Podstawową formą rynku kapitałowego jest rynek papierów wartościowych, które mogą mieć charakter: udziałowy lub dłużny. Dłużne papiery wartościowe to:\n-obligacje – emitent stwierdza, że jest dłużnikiem obligatariusza i zobowiązuje się wobec niego do spełnienia określonego świadczenia. Ze względu na emitenta można wyróżnić m.in. obligacje skarbowe, komunalne i komercyjne;\n-listy zastawne – podstawą są wierzytelności banków hipotecznych zabezpieczone hipotekami lub gwarancją określonych instytucji (m.in. Skarbu Państwa i Narodowego Banku Polskiego)."
   },
   {
      "nr": 19,
      "pytanie": "Instrumenty udziałowe rynku kapitałowego.",
      "odpowiedz": "-akcje – papier wartościowy łączący w sobie prawa o charakterze majątkowym i niemajątkowym, wynikające z uczestnictwa akcjonariusza w spółce akcyjnej;\n-prawo do akcji (tzw. PDA) – papier wartościowy, który powstaje w momencie objęcia nowych akcji spółki w ofercie publicznej, ale przed ich rejestracją w sądzie i złożeniem w KDPW; obrót prawami do akcji podlega takim samym regułom jak obrót akcjami; jego cena jest mocno uzależniona od ceny akcji;\n-prawo poboru – papier wartościowy, który reprezentuje prawo pierwszeństwa objęcia nowych akcji w stosunku do liczby posiadanych akcji; może być przedmiotem obrotu, a jego cena jest uzależniona od ceny akcji i innych parametrów nowej emisji;\n-warrant subskrypcyjny – papier wartościowy imienny lub na okaziciela uprawniający ich posiadacza do zapisu lub objęcia akcji na określonych warunkach, z wyłączeniem prawa poboru;\n-kwit depozytowy – papier wartościowy wystawiany przez instytucję finansową poza granicami kraju, w którym inkorporowane jest prawo do zamiany tego papieru wartościowego na określone papiery wartościowe we wskazanej w warunkach emisji proporcji."
   },
   {
      "nr": 20,
      "pytanie": "Długoterminowe źródła finansowania przedsiębiorstwa.",
      "odpowiedz": "Długoterminowe źródła finansowania przedsiębiorstwa to kapitał pozyskiwany przez firmę na okres dłuższy niż jeden rok, zazwyczaj służący do finansowania projektów inwestycyjnych, zakupu trwałych aktywów, refinansowania istniejącego zadłużenia lub innych potrzeb długoterminowych.\n\n1. Obligacje: Obligacje to długoterminowe papiery wartościowe emitowane przez przedsiębiorstwo lub inne podmioty w zamian za pożyczkę od inwestorów. Posiadacze obligacji otrzymują określone oprocentowanie oraz zobowiązanie do spłaty kapitału po upływie określonego terminu zapadalności.\n\n2. Kredyty długoterminowe: Przedsiębiorstwa mogą uzyskać długoterminowe finansowanie poprzez zaciągnięcie kredytów długoterminowych od banków lub innych instytucji finansowych. Te kredyty mają okres spłaty przekraczający jeden rok i mogą być zabezpieczone lub niezabezpieczone.\n\n3. Kredyty obligatoryjne: Kredyty obligatoryjne to forma długoterminowego finansowania, w której pożyczkodawca wymaga od pożyczkobiorcy zakupu obligacji jako zabezpieczenia za udzielenie kredytu. Pożyczkobiorca ma obowiązek spłacić kapitał i odsetki w ustalonym terminie.\n\n4. Kapitał własny: Choć kapitał własny przedsiębiorstwa nie jest tradycyjnie uważany za źródło długu, może on również stanowić długoterminowe źródło finansowania. Wpływy ze sprzedaży akcji lub emisji nowych akcji mogą być wykorzystane do finansowania długoterminowych projektów inwestycyjnych.\n\n5. Leasing finansowy: Leasing finansowy umożliwia przedsiębiorstwom korzystanie z trwałych aktywów, takich jak sprzęt, maszyny czy nieruchomości, bez konieczności ich zakupu. Przedsiębiorstwo opłaca okresowe raty leasingowe, które obejmują spłatę kapitału i oprocentowanie.\n\n6. Kapitał ryzyka (venture capital): Kapitał ryzyka to forma finansowania, w której inwestorzy (zwykle fundusze venture capital) udzielają kapitału przedsiębiorstwom na wczesnym etapie rozwoju w zamian za udziały w firmie. Jest to długoterminowe źródło finansowania, które może wspierać rozwój przedsiębiorstwa na dłuższą metę.\n\n7. Pożyczki obligatariuszy: Pożyczki obligatariuszy to forma długoterminowego finansowania, w której przedsiębiorstwo pozyskuje kapitał poprzez wydanie obligacji bez warunków zabezpieczenia. Posiadacze obligacji są nazywani obligatariuszami i mają pierwszeństwo w wypłacie w przypadku niewypłacalności przedsiębiorstwa.\n\nTe długoterminowe źródła finansowania zapewniają przedsiębiorstwom stabilne źródła kapitału na rozwój, inwestycje i działalność operacyjną na dłuższą metę. Wybór odpowiedniego źródła finansowania zależy od potrzeb i profilu ryzyka przedsiębiorstwa oraz warunków rynkowych i dostępności kapitału.\n"
   },
   {
      "nr": 21,
      "pytanie": "Zarządzanie zobowiązaniami krótkoterminowymi.",
      "odpowiedz": "Zarządzanie zobowiązaniami krótkoterminowymi obejmuje zarządzanie krótkoterminowymi zobowiązaniami finansowymi firmy, czyli kwotami, które spółka musi spłacić w ciągu najbliższego roku. Obejmuje to zarówno zobowiązania finansowe, takie jak krótkoterminowe kredyty i pożyczki, jak i inne zobowiązania bieżące, takie jak należności wobec dostawców, zobowiązania podatkowe i płace pracowników. Oto kilka kluczowych kroków w zarządzaniu zobowiązaniami krótkoterminowymi:\n\n1. Analiza struktury zobowiązań: Pierwszym krokiem w zarządzaniu zobowiązaniami krótkoterminowymi jest dokładna analiza struktury zobowiązań firmy. Należy zidentyfikować wszystkie zobowiązania krótkoterminowe oraz określić ich źródła i terminy płatności.\n\n2. Monitorowanie i prognozowanie przepływów pieniężnych: Ważnym elementem zarządzania zobowiązaniami krótkoterminowymi jest regularne monitorowanie przepływów pieniężnych oraz prognozowanie ich na przyszłość. Pozwala to na świadome podejmowanie decyzji dotyczących płatności i zarządzania zobowiązaniami.\n\n3. Zarządzanie należnościami i zobowiązaniami: Istotne jest zarządzanie należnościami i zobowiązaniami w taki sposób, aby zminimalizować ryzyko związane z opóźnionymi płatnościami i zobowiązaniami. Może to obejmować negocjowanie terminów płatności z dostawcami oraz ścisłe monitorowanie terminów płatności od klientów.\n\n4. Optymalizacja polityki płatności: Wdrożenie optymalnej polityki płatności może pomóc w zarządzaniu zobowiązaniami krótkoterminowymi. Przedsiębiorstwo może na przykład negocjować korzystne warunki płatności z dostawcami oraz stosować strategie zachęcające klientów do szybszej spłaty należności.\n\nW sumie zarządzanie zobowiązaniami krótkoterminowymi wymaga holistycznego podejścia, uwzględniającego zarówno aspekty finansowe, jak i operacyjne przedsiębiorstwa. Kluczowe jest utrzymanie równowagi między zapewnieniem płynności finansowej a efektywnym wykorzystaniem zasobów firmy.\n\n"
   },
   {
      "nr": 22,
      "pytanie": "Krajowe Standardy Rachunkowości: zakres, cele i przedmiot standardów.",
      "odpowiedz": "Krajowe Standardy Rachunkowości (KSR) to zbiór przepisów i wytycznych określających zasady rachunkowości stosowane w danym kraju. Ich celem jest zapewnienie spójności, transparentności i porównywalności sprawozdań finansowych przedsiębiorstw, co umożliwia użytkownikom lepsze zrozumienie sytuacji finansowej i wyników działalności gospodarczej. Oto główne elementy dotyczące Krajowych Standardów Rachunkowości:\n\nZakres: KSR obejmują wszystkie aspekty rachunkowości, począwszy od klasyfikacji i wyceny aktywów, poprzez zasady ustalania przychodów i kosztów, aż po przedstawianie informacji w sprawozdaniach finansowych. Dotyczą one wszystkich przedsiębiorstw działających na danym rynku, niezależnie od ich wielkości czy sektora.\n\nCele:\nZapewnienie spójności: Standardy rachunkowości mają na celu zapewnienie spójności w sposobie prezentacji danych finansowych, co ułatwia porównywanie wyników różnych przedsiębiorstw.\nZwiększenie transparentności: Standardy rachunkowości mają umożliwić użytkownikom przejrzyste zrozumienie sytuacji finansowej oraz wyników działalności gospodarczej przedsiębiorstwa.\nUłatwienie podejmowania decyzji: Poprzez dostarczanie wiarygodnych i porównywalnych informacji, KSR mają ułatwić zarządzanie i podejmowanie decyzji przez użytkowników sprawozdań finansowych.\nZwiększenie zaufania: Standardy rachunkowości mają na celu zwiększenie zaufania społeczeństwa, inwestorów i innych interesariuszy do sprawozdań finansowych przedsiębiorstw.\n\nPrzedmiotem standardów jest:\nRachunek przepływów pieniężnych;\nPodatek dochodowy;\nNiezakończone usługi budowlane;\nUtrata wartości aktywów;\nLeasing, najem i dzierżawa;\nRezerwy, bierne rozliczenia międzyokresowe kosztów, zobowiązania warunkowe;\nZmiany zasad (polityki) rachunkowości, wartości szacunkowych, poprawianie błędów, zdarzenia następujące po dniu bilansowym;\nDziałalność deweloperska;\nSprawozdanie z działalności;\nUmowy o partnerstwie publiczno-prywatnym oraz umowy koncesji na roboty budowlane lub usługi;\nŚrodki trwałe;\nDziałalność rolnicza;\nKoszt wytworzenia jako podstawa wyceny produktów;\nKontynuacja działalności oraz rachunkowość jednostek przy braku kontynuowania działalności\nPrzychody ze sprzedaży wyrobów, półproduktów, towarów i materiałów.\n"
   },
   {
      "nr": 23,
      "pytanie": "Międzynarodowe Standardy Sprawozdawczości Finansowej: istota, przedmiot regulacji, obowiązek i skutki stosowania przez polskie przedsiębiorstwa.",
      "odpowiedz": "Międzynarodowe Standardy Sprawozdawczości Finansowej (MSSF lub IFRS - International Financial Reporting Standards) to zestaw standardów rachunkowości opracowany przez Międzynarodową Radę Standardów Rachunkowości (IASB - International Accounting Standards Board). Ich celem jest ujednolicenie zasad rachunkowości stosowanych na całym świecie, zapewniając transparentność, porównywalność i wiarygodność sprawozdań finansowych przedsiębiorstw. Oto główne aspekty dotyczące MSSF:\n\n1. Istota: MSSF stanowią ramy regulacyjne dla sporządzania i prezentowania sprawozdań finansowych przez przedsiębiorstwa na całym świecie. Ich celem jest zapewnienie spójności, porównywalności i wiarygodności informacji finansowych oraz ułatwienie podejmowania decyzji przez użytkowników sprawozdań finansowych.\n\n2. Przedmiot regulacji: MSSF obejmują wszystkie aspekty rachunkowości, w tym:\n   - Klasyfikację i wycenę aktywów, zobowiązań i kapitału własnego.\n   - Zasady rozpoznawania przychodów, kosztów i innych zdarzeń gospodarczych.\n   - Metody sporządzania sprawozdań finansowych, w tym bilansu, rachunku zysków i strat oraz dodatkowych informacji.\n   - Zagadnienia związane z konsolidacją sprawozdań finansowych w przypadku grupy spółek.\n   - Polityki rachunkowości, w tym stosowanie zasad standaryzowanych oraz wyjątki i interpretacje w konkretnych sytuacjach.\n\n3. Obowiązek stosowania przez polskie przedsiębiorstwa: W Polsce obowiązek stosowania MSSF dotyczy spółek publicznych notowanych na giełdzie oraz innych podmiotów, które dobrowolnie zdecydują się na ich zastosowanie. Ponadto, spółki te są zobowiązane do przygotowywania sprawozdań finansowych zgodnie z MSSF w przypadku, gdy ich konsolidowane sprawozdania finansowe będą podlegać obowiązkowej weryfikacji przez biegłych rewidentów.\n\n4. Skutki stosowania przez polskie przedsiębiorstwa:\n   - Wiarygodność i porównywalność: Stosowanie MSSF zapewnia większą wiarygodność i porównywalność sprawozdań finansowych, co ułatwia analizę sytuacji finansowej przedsiębiorstw.\n   - Dostęp do międzynarodowych rynków kapitałowych: Spółki stosujące MSSF mogą łatwiej pozyskiwać kapitał na międzynarodowych rynkach finansowych, ponieważ ich sprawozdania finansowe są bardziej zrozumiałe dla inwestorów zagranicznych.\n   - Wpływ na politykę finansową: Stosowanie MSSF może wymagać dostosowania polityki rachunkowości i prowadzenia sprawozdań finansowych, co może wpłynąć na decyzje zarządcze przedsiębiorstwa.\n   - Koszty związane z dostosowaniem: Wdrożenie MSSF może być związane z kosztami związanymi z dostosowaniem systemów rachunkowości, szkoleniami pracowników i uzyskaniem odpowiednich kwalifikacji.\n"
   },
   {
      "nr": 24,
      "pytanie": "Istota rachunku kosztów zmiennych.",
      "odpowiedz": "Nazywany również częściowym rachunkiem kosztów jest systemem, który bazuje na podziale kosztów na koszty stałe i koszty zmienne. Przyjmuje się, że koszty zmienne wytworzenia są proporcjonalne do wielkości produkcji. Z kolei koszty stałe mają charakter bezwzględnie stały w danym okresie. Częściowy rachunek kosztów jest często stosowany, ponieważ dostarcza przydatne informacje w zarządzaniu krótkookresowym.\nRachunek kosztów zmiennych bazuje na podziale kosztów na koszty produkcyjne i koszty nieprodukcyjne. Koszty produkcyjne dzielą się na koszty bezpośrednie oraz pośrednie. Do kosztów bezpośrednich zaliczamy m.in.: materiały i płace. Z kolei pośrednimi kosztami produkcyjnymi są koszty wydziałowe, zarówno stałe, jak i zmienne. Koszty nieprodukcyjne, czyli takie które nie są bezpośrednio związane z produkcją to koszty zarządu i sprzedaży.\nCechy rachunku kosztów zmiennych\nnie jest zgodny z wymogami ustawy o rachunkowości\npodstawową kategorią kosztów są koszty stałe i koszty zmienne\nzapas produktów wyceniany jest w zmiennym koszcie wytworzenia\nodzwierciedla krótkookresowy wynik finansowy\nprzydatny przy podejmowaniu decyzji krótkookresowych\nkoszty reagują na wahania wielkości produkcji\nprowadzony jest na wewnętrzne potrzeby przedsiębiorstwa.\n\nKC= KS + JKZ * X – całkowite k. przedsiębiorstwa w r-ku k. zmiennych\n"
   },
   {
      "nr": 25,
      "pytanie": "Tradycyjna kalkulacja doliczeniowa a rachunek kosztów działań  (ABC).",
      "odpowiedz": "Kalkulacja doliczeniowa – polega na odrębnej ewidencji kosztów bezpośrednich dla poszczególnych produktów oraz doliczeniu do nich, za pomocą specjalnych kluczy rozliczeniowych, odpowiedniej części kosztów pośrednich. W efekcie uzyskujemy koszt zbliżony do kosztu indywidualnego. Kluczem  tym  może  być,  np. suma  płac  bezpośrednich,  suma  maszyno-  lub  roboczo-godzin,  suma  zużytych  materiałów,  suma kosztów bezpośrednich. Istotnym elementem kalkulacji doliczeniowej jest doliczanie (rozliczanie) kosztów pośrednich na poszczególne zlecenia lub asortymenty.  \n\n\nW rachunku ABC koszty należy przypisywać produktom zgodnie ze zużyciem lub zapotrzebowaniem na działania przez poszczególne jednostki.\nZASOBY: R-k kosztów działań ABC podważa tradycyjne metody, że zasoby używane do produkcji zużywają się proporcjonalnie do jej wielkości, wg. metody ABC zużycie zasobów wiąże się przede wszystkim z wykonywanymi działaniami, czy procesami. Koszty produkcji rozlicza się przez pryzmat kosztów zaangażowanych w dany proces.\nKOSZTY: Kalkulacja w metodach tradycyjnych wymaga zebrania wszystkich kosztów i rozliczenia ich na produkty. W modelu ABC produkty obciążają jedynie koszty potrzebne do ich wytworzenia.\nWYDATKI: W modelach tradycyjnych koszty grupuje się wg miejsc ich powstawania. W modelu ABC wydatki definiuje się jako zbiory działań i wten sposób ewidencjonuje. R-k ABC jest rachunkiem wieloetapowym, zaczynamy wyszczególnieniem działań w firmie, a kończymy kosztami tych działań.\n"
   },
   {
      "nr": 26,
      "pytanie": "Wymień rodzaje struktur organizacyjnych wykorzystywanych przy realizacji projektów.",
      "odpowiedz": "1. Struktura liniowa:\n   - W strukturze liniowej personel projektu jest hierarchicznie zorganizowany w liniowy sposób, gdzie każdy pracownik raportuje bezpośrednio do swojego kierownika linii.\n   - Kierownik projektu ma pełną kontrolę nad zespołem projektowym i działa bezpośrednio pod kierownictwem wyższego szczebla organizacji.\n   - Ta struktura jest prosta i łatwa do zrozumienia, ale może prowadzić do problemów z komunikacją i koordynacją między różnymi działami organizacji.\n\n2. Struktura liniowo-sztabowa:\n   - Struktura liniowo-sztabowa łączy elementy struktury liniowej z zespołami wsparcia, zwanych sztabami, które mogą zapewniać specjalistyczną wiedzę i zasoby.\n   - Kierownicy projektów mają pełną kontrolę nad zespołami projektowymi, ale mogą korzystać z zasobów i wsparcia dostarczanego przez sztaby.\n   - Ta struktura umożliwia dostęp do specjalistycznej wiedzy i umiejętności, co może przyczynić się do lepszego wykonywania projektów.\n\n3. Struktura macierzowa:\n   - W strukturze macierzowej personel projektu jest zorganizowany według funkcji, ale równocześnie istnieją zespoły projektowe, które działają niezależnie od działów funkcjonalnych.\n   - Pracownicy są przydzielani do projektów, ale nadal podlegają kierownictwu swoich działów funkcjonalnych i kierownikom projektów.\n   - Ta struktura może prowadzić do konfliktów władzy między kierownikami projektów a kierownikami funkcjonalnymi oraz do trudności w zarządzaniu zespołami.\n\n4. \"Czysta\" struktura projektowa:\n   - W \"czystej\" strukturze projektowej cała organizacja jest zorganizowana wokół projektów.\n   - Każdy projekt ma własny zespół projektowy, który jest odpowiedzialny za realizację celów projektu.\n   - Kierownik projektu ma pełną kontrolę nad zespołem projektowym i zasobami przydzielonymi do projektu.\n   - Ta struktura organizacyjna jest szczególnie skuteczna w przypadku firm realizujących wiele projektów jednocześnie.\n\n5. Spółka-córka projektowa:\n   - W strukturze spółki-córki projektowej projekt jest realizowany przez odrębną spółkę, która została utworzona specjalnie w celu wykonania tego projektu.\n   - Spółka-córka może być kontrolowana przez główną firmę lub działać jako niezależna jednostka.\n   - Ta struktura może pomóc w izolowaniu ryzyka związanego z projektem od głównej firmy oraz w zapewnieniu elastyczności i niezależności operacyjnej.\n\n6. Realizacja projektu przez instytucje zewnętrzne:\n   - W tej strukturze organizacyjnej projekt jest realizowany przez zewnętrzną instytucję, taką jak agencja doradcza, firma konsultingowa lub kontrahent zewnętrzny.\n   - Organizacja zleca wykonanie projektu zewnętrznej instytucji, która ma odpowiednie doświadczenie i zasoby do wykonania zadania.\n   - Ta struktura może być stosowana w przypadku projektów, które wymagają specjalistycznej wiedzy lub umiejętności, których organizacja nie ma wewnętrznie.\n"
   },
   {
      "nr": 27,
      "pytanie": "Omów cykl życia projektu.",
      "odpowiedz": "Inicjacja projektu – potrzeba realizacji projektu, określenie wizji projektu. Impulsem do rozpoczęcia projektu może być przykładowo: zapytanie ofertowe z zewnątrz organizacji, pomysł na lepsze zaspokojenie potrzeb klienta, możliwość pozyskiwania środków finansowych ze źródeł zewnętrznych, pomysł na zmianę  w organizacji służącą osiągnięciu jej celów strategicznych.\nFaza przygotowawcza – powołuje się grupę projektową i ustala kto będzie liderem. Plan projektu to ujęty w formie pisemnej, plan prezentujący zasady realizacji fazy wykonawczej i zamykającej projektu, zawiera opis działań, terminy realizacji, zapotrzebowanie na zasoby oraz koszty realizacji projektu, jest przedmiotem zatwierdzenia przez sponsora (klienta), może stanowić ofertę realizacji przedsięwzięcia oraz podstawę zawarcia przyszłego kontraktu między sponsorem,  a jednostką wykonawczą, zatwierdzony plan projektu stanowi „wielkość bazową” w przyszłym zarządzaniu projektem,  wykorzystywany jest jako źródło informacji dla członków zespołów wykonawczych i innych osób w organizacji, • ujednolica terminologię stosowaną w projekcie.\nFaza realizacji – realizacja zadań, aby osiągnąć cel projektu. „Otwarcie” projektu: spotkanie inaugurujące fazę realizacyjną, czyli spotkanie kluczowych osób w celu: wzajemnego poznania się i identyfikacji obszarów odpowiedzialności, określenia filozofii prowadzenia prac – określenie głównych ról, określenie zestawu wymaganych spotkań, ich miejsca i częstotliwości oraz kto powinien brać w nich udział, analiza tego co i jak należy wykonać oraz problemów przewidywanych w fazie realizacji, dyskusja kolejności operacji lub ograniczeń występujących w harmonogramie, itp.\nFaza zamykająca – domknięcie wszystkich spraw. Analiza i uznanie osiągnięć to spotkanie podsumowujące projekt, czyli spotkanie całego zespołu w celu: zastanowienie się: co w projekcie zostało wykonane poprawnie, jakie obszary wymagają usprawnienia, co było źle, dlaczego? Itp., wypracowanie wniosków, z których skorzysta się w trakcie realizacji kolejnych przedsięwzięć, określenie jakie zagadnienia należy ująć w bazie wiedzy, aby kończący się projekt był źródłem wiedzy do prowadzenie następnych, świętowania zakończenia projektu ( przedłużeniem może być huczny wieczór).\n"
   },
   {
      "nr": 28,
      "pytanie": "Przedstaw przykładowe role organizacyjne (zadania, uprawnienia i odpowiedzialność) realizowane w ramach wybranej funkcji przedsiębiorstwa.",
      "odpowiedz": "Kierownik - sprawując funkcje zarządcze odgrywa jednocześnie szereg różnych ról organizacyjnych:\nrola interpersonalna: reprezentacja firmę wewnątrz i na zewnątrz, motywowanie pracowników, ocenianie, przyznawanie premii, kontrolowanie pracowników, rozwiązywanie konfliktów, prowadzenie zebrań zespołowych;\nrola informacyjna: doskonalenie przepływu informacji, obiegu dokumentów, jasne przekazywanie informacji;\nrola decyzyjna: podział zadań pomiędzy pracownikami, podejmowanie decyzji strategicznych, wprowadzanie innowacji i związanego z nimi ryzyka wejścia na nowe rynki zbytu, rola negocjatora.\n"
   },
   {
      "nr": 29,
      "pytanie": "Przedstaw związki zachodzące między funkcjami podstawowymi, pomocniczymi i regulacyjnymi przedsiębiorstwa.",
      "odpowiedz": "Funkcje podstawowe same nie istnieją. Muszą być spełnione dodatkowe funkcje pomocnicze i regulacyjne (zarządzania, kierowania).\nElementy składowe f. zarządzania, a więc planowanie, organizowanie, motywowanie \ni kontrolowanie, na których opiera się proces zarządzania, dotyczą zasobów materialnych \ni niematerialnych przedsiębiorstwa. Natomiast zasoby te są konieczne, aby można było realizować zadania w ramach f. podstawowych i pomocniczych.\nJeśli produkcja jest f. podstawową, a księgowość pomocniczą, to realizacja zadań z tych obszarów pociąga za sobą zaangażowanie ludzi, aparatury, śr. finansowych i wiedzy.  Tymi zasobami ktoś musi zarządzać, w rezultacie wypełniając f. zarządzania. Pomimo, że są to różne funkcje, to występują łącznie.\nW strukturze organizacyjnej przedsiębiorstwa podziałowi funkcji na podstawowe, pomocnicze i regulacyjne odpowiada podział jednostek na podstawowe (np. dział produkcji), pomocnicze (np. dział księgowości, dział personalny) i regulacyjne (np. prezes, naczelny dyrektor).\n"
   },
   {
      "nr": 30,
      "pytanie": "Pojęcie i klasyfikacja innowacji.",
      "odpowiedz": "Innowacja jest to wdrożenie w praktyce gospodarczej nowego albo znacząco udoskonalonego produktu, usługi lub procesu, w tym także wdrożenie nowej metody marketingowej lub organizacyjnej redefiniującej sposób pracy lub relacje przedsiębiorstwa z otoczeniem. \nKlasyfikacja innowacji kryterium zakres/obszar:\n1) Innowacja produktowa- ma miejsce wówczas gdy wprowadza się nowy produkt usługę, a także na się do czynienia z udoskonaleniem już wytworzonego produktu. Pojęcie udoskonalania jest szerokie, np. udoskonalanie materiałów stosowanych w produkcji, rozszerzenie zakresu działania (nowe funkcje).\n2) Innowacja procesowa- następuje w drodze wdrożenia nowej technologii produkcji lub metody dostaw. Może to być także zastosowanie ulepszonej technologii produkcji lub metody dostaw, np. wprowadzenie controllingu.\n3) Innowacja organizacyjna- sprowadza się do zmian odnoszących się do procedur czy struktur, np. organizacyjnej.\n4) Innowacja marketingowa- odnosi się do zmian w elementach marketingu mix, np. zastosowanie nowego, bardziej funkcjonalnego od stosowanych dotychczas przez producenta."
   },
   {
      "nr": 31,
      "pytanie": "Podział form własnego i obcego finansowania innowacji.",
      "odpowiedz": "Źródła finansowania własnego innowacji w przedsiębiorstwie:\nNadwyżka finansowa netto (zysk netto+amortyzacja),\nKapitał zakładowy netto zależnie od formy organizacyjno-prawnej przedsiębiorstwa: kapitał wspólników, kapitał akcyjny kapitał udziałowy.\nKapitał rezerwowy.\nŹródła finansowania obcego innowacji w przedsiębiorstwie:\nkredyt bankowy, kredyt technologiczny (uzysk finansowy -postać premii technologicznej),\npieniężna pożyczka pozabankowa od innych przedsiębiorstw,\npożyczka obligacyjna (zasięgana przez przedsiębiorstwo poprzez emisję obligacji),\nleasing,\nfranchising,\nfactoring (wykup przez podmiot świadczący usługę factoringu wierzytelności należnych im od kontrahentów z tyt. dostaw i usług),\nśrodki pochodzące od aniołów biznesu (inwestorów prywatnych),\ncrowdfunding (finansowanie społecznościowe- wpłaty osób zainteresowanych projektem),\nprivate equity (przejęcie spółki na własność prywatną w celu restrukturyzacji przed ponowną sprzedażą z oczekiwaniem zyskiem),\nfundusze venture capital (dostarczanie spółkom wyróżniającym się dużym potencjałem rozwoju kapitału, doświadczenia i wiedzy),\nfundusze seed capital (część VC, fundusze inwestujące w najwcześniejsze fazy rozwoju projektów- przed rozpoczęciem prac; środki na wejście na rynek)\n"
   },
   {
      "nr": 32,
      "pytanie": "Przedstaw mocne i słabe strony firm będących innowatorami.",
      "odpowiedz": "Mocne strony:\npodniesienie prestiżu przedsiębiorstwa, wzmocnienie marki,\nrozwijanie ekosystemu,\nzdobycie nowych rynków (segmenty, przestrzeń),\nzwiększanie satysfakcji konsumentów,\nwzrost zysków przedsiębiorstwa,\nnabywanie wiedzy, opatentowanie nowości, prawa autorskie,\nunowocześnienie parku maszynowego przedsiębiorstwa, zwiększenie produktywności,\nusprawnienie procesów wewnątrzorganizacyjnych,\npoprawa warunków i bezpieczeństwa pracy.\nSłabe strony:\n-ryzyko finansowe- związane z trudnością pozyskania środków finansowych do realizacji projektu,\n-ryzyko projektu- związane z technicznymi warunkami realizacji projektu,\n-ryzyko właścicieli -związane z brakiem dywersyfikacji kierunków rozwoju przedsiębiorstwa,\n-ryzyko powstania substytutów- związanie z działaniami konkurencji, naśladownictwo.\n"
   },
   {
      "nr": 33,
      "pytanie": "Wymień wewnętrzne i zewnętrzne bariery ograniczające innowacyjność pracowników.",
      "odpowiedz": "Wewnętrzne:\nbrak pozytywnych doświadczeń w realizowaniu nowości,\nobawy przed popełnieniem błędu,\nobawy, że wprowadzane zmiany obniżą prestiż pracowników (maszyna zastąpi człowieka),\nobawy, że wprowadzane zmiany stworzą wymagania, którym pracownik nie będzie mógł sprostać (konieczność dokształcania),\nobawy, że poparcie innowacji narazi innych na straty lub spowoduje narażenie się osobom przeciwnym jej wprowadzeniu,\nskłonności do trwania przy starych wypróbowanych wzorcach,\nobawy, że zmiany nie będą korzystne lub korzyści nie pokryją poniesionych nakładów,\ngroźba pogorszenia relacji między wydatkowanym wysiłki m a wynagrodzeniem i zadowoleniem z pracy (niedostateczny system premiowania).\nZewnętrzne:\nnieuwzględnianie utrwalonych w organizacji nieformalnych wzorów i norm postępowania,\nwarunki, na jakich zmiana jest oparta, np. gdy są one niekorzystne lub niewłaściwy jest sposób realizacji zmian,\nbrak rzetelnej informacji, co utrudnia zrozumienie potrzeby innowacji,\nwprowadzanie zmian poprzez bezwzględne narzucanie.\n"
   },
   {
      "nr": 34,
      "pytanie": "Omów zasady zarządzania jakością wg normy ISO 9001:2015.",
      "odpowiedz": "Zasady zarządzania jakością umożliwiają sprawne funkcjonowanie oraz doskonalenie. Nowelizacja norm z serii ISO 9001:2015 zmniejszyła ilość zasad zarządzania jakością z ośmiu do siedmiu. Usunięto zasadę: systemowe podejście do zarządzania kładąc jeszcze większy nacisk na podejście procesowe oraz ciągłe doskonalenie.\n\n\n1. Orientacja na klienta- oznacza to, że celem organizacji jest spełnianie wymagań klienta oraz zwiększanie jego satysfakcji, dzięki zastosowaniu systemu, ciągłego doskonalenia, wypełnianiu wymagań prawa jakie powinien spełniać produkt/usługa oraz wychodzenie naprzeciw oczekiwaniom konsumenta.\n2. Przywództwo- kadra zarządzająca powinna tu pełnić rolę liderów, nie nadzorców. Skuteczne przywództwo polega na wpływaniu na pracowników oraz wykorzystaniu ich potencjału.\n\n\n3. Zaangażowanie pracowników- nieskuteczna komunikacja pomiędzy poszczególnymi pracownikami oraz działami w firmie w praktyce utrudnia, albo wręcz uniemożliwia dostarczenie klientowi produktu bądź usługi zgodnej z jego oczekiwaniami. Przydatne są także oceny pracowników, szkolenia, skuteczna motywacja oraz integracja.\n4. Podejście procesowe- identyfikacja poszczególnych czynności i powiązań między nimi, co ma prowadzić do poprawy wyników organizacji. Dodatkowo procesy powinny być zarządzane łącznie jako jeden system. Umożliwia to sprawną identyfikację problemów, ich korektę oraz zapobieganie w przyszłości.\n5. Ciągłe doskonalenie- każdy z elementów powinien być nieustannie poprawiany. Dotyczy to zarówno działania systemu, jak i procedur oraz kwalifikacji pracowników. Ważną rolę pełnią różnego rodzaju audyty oraz analizy. Kolejne kroki udoskonalania to zgodnie z teorią Deminga planowanie, wykonywanie, kontrolowanie oraz poprawa.\n6. Podejmowanie decyzji oparte na dowodach- należy opierać je na wynikach badań, analiz i pomiarów. Wykorzystywane dane powinny być dokładne i rzetelne, a także dostępne w razie potrzeby.\n7. Wzajemnych korzystnych relacji z dostawcami (w stosunkach z zainteresowanymi stronami)- to zadanie ułatwia sprawna, szczegółowa komunikacja na temat poszczególnych etapów dostaw oraz pojawiających się problemów.\n"
   },
   {
      "nr": 35,
      "pytanie": "Scharakteryzuj dyrektywy „nowego podejścia” i określ ich znaczenie w zarządzaniu jakością w Unii Europejskiej.",
      "odpowiedz": "Dyrektywy nowego podejścia określają zasadnicze wymagania bezpieczeństwa dla różnych grup wyrobów, które należy spełnić przed ich wprowadzeniem do obrotu lub oddaniem do użytku na Jednolitym Rynku Europejskim.\n Dyrektywy Nowego Podejścia zawierają tylko zasadnicze wymagania związane z bezpieczeństwem, zdrowiem, ochroną konsumenta i ochroną środowiska. Niektóre uwzględniają inne aspekty, jak np. oszczędność energii, dokładność metrologiczną wskazań przyrządów pomiarowych, bezpieczeństwo transportu niektórych urządzeń. Każda z dyrektyw Nowego Podejścia nakłada obowiązek umieszczenia na podlegających jej wyrobach oznakowania „CE\". Aby oznakować swój wyrób znakiem CE, producent wykonuje analizy i podejmuje działania dla spełnienia odnośnych wymagań, a następnie poddaje produkt procedurze oceny zgodności z odpowiednimi dyrektywami. Przebieg i wyniki działań producent dokumentuje. Dyrektywy Nowego Podejścia obowiązują 28 państw członkowskich UE (w tym Polskę) oraz na mocy porozumienia o Europejskim Obszarze Gospodarczym, również Norwegię, Islandię i Księstwo Lichtenstein. Do chwili obecnej przyjęto prawie trzydzieści dyrektyw Nowego Podejścia określających wymagania w odniesieniu do dużych grup wyrobów, w tym maszyn, zabawek, wyrobów medycznych, elektrycznych i elektronicznych, materiałów budowlanych itd.\nWszystkie działania zostały ustanowione w celu eliminowania barier w przepływie towarów na rynku Unii.\n"
   },
   {
      "nr": 36,
      "pytanie": "Wyjaśnij różnice między audytem jakości a kontrolą jakości.",
      "odpowiedz": "Audyt jakości:\n* Kładzie nacisk na przyczyny niekorzystnego zjawiska, może działać zapobiegawczo, wskazując potencjalne ryzyka  (cel: wykazanie zgodności)\n* Wydzielona komórka organizacyjna profesjonalnie zajmująca się audytem.\n* Weryfikowanie i monitorowanie działania systemu kontroli wewnętrznej oraz procesów zarządzania.\n* Wspieranie zarządzania firmą, dzięki systematycznej i metodycznej ocenie skuteczności całego systemu kontroli wewnętrznej.\n\nKontrola jakości\n* Reaguje przede wszystkim na objawy niekorzystnego zjawiska, działa wyłącznie „po fakcie” (cel: znalezienie błędów)\n* Zespół mechanizmów kontrolnych na wszystkich szczeblach organizacyjnych, działania wbudowane w jej strukturę.\n* Zbiór reguł, procedur, metod i sposobów wykonywania określonych czynności.\n* Bieżące, regularne kontrolowanie wszystkich czynności i procesów."
   },
   {
      "nr": 37,
      "pytanie": "Zdefiniuj pojęcie procesu w przedsiębiorstwie oraz omów klasyfikację procesów.",
      "odpowiedz": "Proces to ciąg sekwencji logicznych, następujących po sobie, które przekształcają wymaganie w efekty. W procesie zawsze wysypują: zasoby (rzeczowe, finansowe, ludzkie, informacyjne), właściciel procesu, czynniki zewnętrzne (konkurencja, klienci), czynniki wewnętrzne, dane wejściowe na podstawie których buduje się proces, dane wyjściowe (efekt). Proces musi być mierzalny. \n Podstawowe (główne):\n* działania marketingowe, sprzedażowe, projektowania produktów, dystrybucji;\n* bezpośrednio generują wartość dodaną;\n* klient najłatwiej je dostrzega i poprzez nie ocenia jakość i sprawność działania;\n\nPomocnicze:\n* działania magazynowania, kontroli jakości konserwacji i utrzymania ruchu, rekrutacji i oceny kadr, obsługi finansowo-księgowej;\n* pośrednio generują wartość dodaną;\n* klient słabo dostrzega ich jakość w związku z czym mają niewielki wpływ na kształtowanie zewnętrznego wizerunku organizacji; \t\n\nZarządzania:\n* określenie misji, strategii i zasad działania całej organizacji, w tym monitorowanie efektywności procesów.\n* mają strategiczny wpływ na sposób generowania wartości dodanej;\n* regulują procesy podstawowe i pomocnicze;\n\n"
   },
   {
      "nr": 38,
      "pytanie": "Co należy rozumieć przez mapę procesu? Podaj przykład mapy dla wybranego procesu.",
      "odpowiedz": "Mapa procesu jest to graficzne przedstawienie procesu bądź zespołu procesów wraz z ich wzajemnymi powiązaniami. Najważniejsze zalety wdrożenia mapowania procesu, to było by to: standaryzacja operacji, punkt wyjścia do rozwoju, doskonalenia i optymalizacji organizacji, ułatwienie rozwiązywania problemów, zmniejszenie strat poprzez szybkie identyfikowanie wąskich gardeł.\nMapa procesu składa się z następujących etapów:\nnazwanie procesu,\nokreślenie granic procesu – wejścia/wyjścia,\nokreślenie poszczególnych operacji w procesie,\nnarysowanie schematu z wykorzystaniem odpowiednich symboli graficznych,\nopisanie poszczególnych elementów schematów,\npołączenie elementów graficznych strzałkami wskazującymi kierunek przebiegu,\nwprowadzenie komentarzy.\n"
   },
   {
      "nr": 39,
      "pytanie": "Istota tablic kompetencyjnych oraz ich rola w zarządzaniu procesowym.",
      "odpowiedz": "Tablice kompetencyjne są narzędziem używanym w zarządzaniu zasobami ludzkimi, które służy do określenia i oceny umiejętności, wiedzy, doświadczenia i cech osobowych pracowników w kontekście ich pracy. Istotą tablic kompetencyjnych jest zdefiniowanie oczekiwanych kompetencji dla danej roli lub stanowiska w organizacji.\nRola w zarządzaniu procesowym:\nRekrutacja i selekcja personelu: Tablice kompetencyjne pomagają w określeniu kryteriów rekrutacyjnych i selekcyjnych dla nowych pracowników, co ułatwia dopasowanie kandydatów do wymagań danej roli.\nRozwój personelu: Służą do identyfikowania obszarów rozwoju dla pracowników poprzez porównanie ich kompetencji z oczekiwanymi standardami dla danej roli, co umożliwia opracowanie planów rozwoju i szkoleń.\nOcena pracownicza: Tablice kompetencyjne służą do oceny wydajności pracowników poprzez porównanie ich kompetencji z oczekiwanymi standardami, co pozwala na identyfikację obszarów wymagających ulepszeń lub wsparcia.\nPlanowanie sukcesji: Umożliwiają identyfikację potencjalnych liderów i sukcesorów dla kluczowych stanowisk poprzez analizę kompetencji pracowników.\nZarządzanie zmianą: Pomagają w identyfikacji pracowników posiadających odpowiednie kompetencje do przeprowadzenia zmiany procesowej i zapewnienia sukcesu wdrożenia nowych procesów biznesowych."
   },
   {
      "nr": 40,
      "pytanie": "Jak należy rozumieć określenie: „zintegrowany system zarządzania”?",
      "odpowiedz": "Zintegrowany system zarządzania najczęściej definiuje się jako dwa albo więcej współdziałających ze sobą i wzajemnie się uzupełniających podsystemów funkcjonujących w danej organizacji. Bardzo często integracja obejmuje system zarządzania jakością, zarządzania środowiskowego i zarządzania bezpieczeństwem i higieną pracy, przy czym należy zaznaczyć, że celem jest uzyskanie skuteczności działania wyższej, niż w przypadku, gdyby każdy ze wspomnianych systemów funkcjonował w oderwaniu od pozostałych. W tym kontekście za najważniejsze cechy zintegrowanych systemów zarządzania należy uznać przede wszystkim:\nwielomodułowość (każdy zintegrowany system zarządzania przedsiębiorstwem składa się z co najmniej dwóch mniejszych podsystemów),\nwspólny dla wszystkich modułów interfejs użytkownika,\nmożliwość uzyskania dostępu do systemu z różnych miejsc,\nskalowalność (nie ma konieczności inwestycji w infrastrukturę w miarę rozwoju przedsiębiorstwa),\notwartość (system może być bez problemu rozbudowywany i poszerzany o nowe moduły, jeśli zachodzi taka potrzeba),\nniskie albo nawet zerowe koszty administracji,\nbezpieczeństwo całego systemu.\n"
   },
   {
      "nr": 41,
      "pytanie": "Istota oraz podstawowe założenia strategicznej karty wyników.",
      "odpowiedz": "Strategiczna karta wyników (Balanced Scorecard) to narzędzie zarządzania strategicznego, które pomaga organizacjom w definiowaniu, monitorowaniu i osiąganiu strategicznych celów. Jej istotą jest skupienie uwagi nie tylko na tradycyjnych wskaźnikach finansowych, ale także na innych kluczowych aspektach, takich jak klient, procesy wewnętrzne, nauka i rozwój, co pozwala na kompleksową ocenę wydajności i osiągnięcie długoterminowych celów.\nPodstawowe założenia strategicznej karty wyników to:\n1. Zbalansowane podejście: Karta wyników jest zbalansowanym narzędziem, które uwzględnia zarówno wskaźniki finansowe, jak i pozafinansowe. Oprócz klasycznych aspektów finansowych (np. rentowność, przychody), uwzględnia również wskaźniki związane z klientem, procesami wewnętrznymi i możliwościami nauki i rozwoju.\n2. Współdziałanie między obszarami: Karta wyników identyfikuje związki przyczynowo-skutkowe między różnymi obszarami działalności organizacji. Oznacza to, że osiągnięcia w jednym obszarze (np. zadowolenie klienta) wpływają na wyniki w innych obszarach (np. wyniki finansowe).\n3. Ustalanie celów strategicznych: Przy tworzeniu karty wyników organizacja identyfikuje kluczowe cele strategiczne, które chce osiągnąć. Cele te są zwykle związane z misją, wizją i strategią organizacji.\n4. Wskaźniki wyników i wskaźniki przyczynowo-skutkowe: Dla każdego celu strategicznego definiowane są konkretne wskaźniki wyników, które pomagają w ocenie osiągnięcia celu. Ponadto określa się także wskaźniki przyczynowo-skutkowe, które wskazują, co musi zostać zrobione (np. procesy, umiejętności, technologie), aby osiągnąć te cele.\n5. Monitorowanie i korekta: Karta wyników jest narzędziem ciągłego monitorowania postępów w osiąganiu celów strategicznych. Organizacja regularnie ocenia swoje wyniki w kontekście założonych celów i podejmuje działania korygujące, jeśli jest to konieczne.\nStrategiczna karta wyników pomaga organizacjom w skoncentrowaniu się na najważniejszych aspektach działalności oraz w skuteczniejszym zarządzaniu zmianami i osiąganiu długoterminowych celów. Dzięki niej można lepiej zrozumieć, jakie działania są kluczowe dla sukcesu organizacji i skupić na nich uwagę i zasoby.\n"
   },
   {
      "nr": 42,
      "pytanie": "Przedstaw schemat analizy DuPonta. Na czym polega integracja zarządzania oparta na tej analizie?",
      "odpowiedz": "Analiza Du Ponta także model Du Ponta, piramida Du Ponta – metoda umożliwiająca \nprzeprowadzenie oceny zyskowności/rentowności przedsiębiorstwa przy pomocy wybranych danych finansowych pochodzących z rachunku zysków i strat oraz bilansu. \nUkazuje ona zależności przyczynowo-skutkowe zachodzące pomiędzy bardzo ogólnymi wskaźnikami (takimi jak ROE – rentowność kapitału własnego, czy ROA – rentowność aktywów) oraz wskaźnikami występującymi na niższych poziomach piramidy (zyskowność netto – ROS, czy obrotowość aktywów – TAT). Układ piramidy pozwala na analizę od ogółu do szczegółu (z góry „czubka” piramidy do dołu „podstawy” piramidy) oraz od szczegółu do ogółu (od „podstawy” do „czubka”).\nWskaźnik rentowności kapitału własnego – ROE = (Zysk Netto / Kapitał Własny)*100%\nROE jest miarą korzyści czerpanych przez właścicieli z zainwestowanego w spółkę kapitału.\nWskaźnik ten określa, ile zł czystego zysku spółka uzyskała z 1 zł kapitałów własnych. Im wartość wskaźnika ROE wyższa, tym większa atrakcyjność spółki dla inwestorów i szybszy czas odzyskania kapitału zainwestowanego.\nWskaźnik dźwigni finansowej - Dźwignia finansowa = Aktywa ogółem / Kapitał Własny\nEfekt dźwigni finansowej to wzrost rentowności kapitału własnego spowodowany wzrostem zadłużenia. Dźwignia wyraża, jaka część aktywów jest finansowana przez kapitał własny. Dźwignia pozwala zwiększyć wartość aktywów bez potrzeby inwestowania własnych pieniędzy, umożliwiając wzrost rentowności kapitałów własnych. Uwaga! Dodatni efekt dźwigni występuje tylko wówczas, jeśli rentowność aktywów przewyższa oprocentowanie długu.\nWskaźnik rentowności aktywów – ROA = (Zysk Netto / Aktywa)*100%\n\nROA informuje o zdolności spółki do wypracowywania zysków posiadanymi aktywami oraz o efektywności  ich gospodarowania. Stopa ROA informuje, ile zysku generuje każda złotówka z jednostki  aktywów. Wskaźnik ROA może być obliczany jako iloczyn rentowności sprzedaży (ROS) oraz wskaźnika obrotu aktywów. Im wyższa wartość ROA, tym  lepsza  jest kondycja finansowa spółki i wyższy wskaźnik ROE.\n\nWskaźnik rentowności sprzedaży – ROS = (Zysk Netto / Przychody ze sprzedaży)*100%\n\nJest relacją wyniku netto do wartości sprzedaży produktów, towarów i materiałów. Informuje o tym, ile zysku osiąga przedsiębiorstwo na 1 złotówkę uzyskanych przychodów ze sprzedaży. Im wartość tego wskaźnika jest wyższa, tym większa jest efektywność działalności przedsiębiorstwa i wyższy zwrot z aktywów (ROA).\n\nDzięki tak pogłębionej analizie możliwa staje się nie tylko pełna i kompleksowa ocena obecnej działalności przedsiębiorstwa, ale także przewidywanie dalszego kierunku oraz tempa jego rozwoju. Układ piramidy pozwala również na analizę w ujęciu czasowym, retrospektywnym i prognostycznym.\nW analizie rentowności przyjmuje się, że najbardziej syntetycznym wskaźnikiem jest stopa zwrotu z kapitału własnego(ROE). Jej poziom jest uzależniony od kilku głównych obszarów decyzyjnych firmy, które odzwierciedlają określone wskaźniki. Do tych obszarów zalicza się:"
   },
   {
      "nr": 43,
      "pytanie": "Jak wykorzystać takie narzędzia jak Karta Przebiegu czy Karta Obiegu Dokumentów do diagnozowania i poprawy procesów w organizacji?",
      "odpowiedz": "Karta Przebiegu to arkusz, na którym rejestruje się graficznie, a często też opisowo czynności wykonywane kolejnego przez jednego lub kilu pracowników w trakcie badanego procesu.\nKarta Obiegu Dokumentów jest odmianą Karty Przebiegu i stosowana jest w badaniu \ni usprawnianiu pracy biurowej.\nIch wykorzystanie w organizacji umożliwia:\nwykrycie oraz ograniczenie samowoli i dowolności,\nwykrycie przewidywalności i powtarzalności realizowanych procesów,\nciągłe doskonalenie procesów,\nrelatywnie  wyższym  poziomem  zaspokojenia  oczekiwań  klientów  zewnętrznych oraz wewnętrznych,\nzwiększenie efektywności podejmowania decyzji,\nuproszczenie obiegu (zmniejszenie liczby uczestników oraz liczby operacji),\nskrócenie czasu obiegu,\nzmniejszenie liczby kopii,\nlikwidację dublujących się dokumentów.\n"
   },
   {
      "nr": 44,
      "pytanie": "Wymień i scharakteryzuj zasady, na których opiera się reengineering?",
      "odpowiedz": "Reengineering to metoda polegająca na gruntownym przekształceniu procesów przedsiębiorstwa, która ma na celu poprawę jego funkcjonowania. Wymaga  zmiany sposobu  myślenia  i  wprowadzania  drastycznych  zmian.  \nZasady:\nZastąpienie komórek funkcjonalnych w firmie, przez zespoły odpowiedzialne za konkretny proces biznesowy.\nZastępowanie prostych zadań, przez pracę wielowymiarową.\nZmianę roli pracowników z wykonawców, w kreatorów rozwiązań (np. współuczestniczą w procesie tworzenia produktu).\nOgraniczanie kontroli i zwiększanie autonomii stanowisk w firmie.\nWynagradzanie pracowników za wyniki, a nie za samą aktywność.\nZmianę roli przełożonych (z funkcji kontrolnej na koordynującą i inspirującą).\nZmianę struktur hierarchicznych (demokratyzacja procesów zarządzania).\nGromadzenie informacji w jednym, ogólnodostępnym banku danych.\n"
   },
   {
      "nr": 45,
      "pytanie": "Jakie problemy z punktu widzenia potrzeb zaspokajania klientów mogą wynikać z pionowego rozczłonkowania organizacji?",
      "odpowiedz": "Rozczłonkowanie pionowe:\na) rozpiętość kierowania czyli liczba bezpośrednich podwładnych kierownika,\nb) zasięg kierowania czyli liczba bezpośrednich i pośrednich podwładnych.\nPROBLEMY\nprzepływ informacji pomiędzy poszczególnymi działami jest zbyt długotrwały,\nkilkukrotna kontrola faktur przez pracowników poszczególnych działów,\nzbyt długi czas przetwarzania informacji zawartych w zamówieniu - brak natychmiastowej reakcji na informacje przekazywane przez klienta,\nzbyt długi czas oczekiwania na całościową obsługę - od momentu złożenia zamówienia do momentu jego realizacji,\njeżeli  pojawi się problem dotyczący klienta, poszczególne komórki  organizacyjne  zrzucają  winę  na  inne  działy,  zamiast  dążyć  do  współdziałania i przekonania, że kłopot ten jest kłopotem całej organizacji,\nschematyczne traktowanie klienta,\nkłopotliwa procedura realizacji zamówienia - zbyt duża ilość dodatkowych dokumentów,\nkażda zmiana wymaga angażowania osób z wyższego szczebla zarządzania \nw procesy informacyjno-decyzyjne, co z kolei wymusza przepływ danych \ni informacji wzdłuż linii powiązań hierarchicznych.\n"
   }
]