[
   {
      "nr": 1,
      "pytanie": "Pojęcie algorytmu oraz metody prezentacji algorytmów",
      "odpowiedz": "Algorytm to zestaw ściśle określonych czynności, prowadzących do wykonania pewnego zadania. \n Zdefiniowany algorytm może zostać zapisany w wybranym języku programowania. \nZapis algorytmu w wybranym języku programowania nazywamy implementacją algorytmu."
   },
   {
      "nr": 2,
      "pytanie": "Język C – programowanie z wykorzystaniem wskaźników.",
      "odpowiedz": "Język C został opracowany jako strukturalny język programowania do celów ogólnych. \nCzęsto wykorzystywany jest także do oprogramowywania mikrokontrolerów i systemów wbudowanych."
   },
   {
      "nr": 3,
      "pytanie": "Operacje wejścia/wyjścia w językach programowania.",
      "odpowiedz": "Wejście i wyjście to komunikacja między systemem przetwarzania informacji, takim jak komputer, a światem zewnętrznym, prawdopodobnie człowiekiem lub innym systemem przetwarzania informacji. \n Operacje wejścia to sygnały lub dane odbierane przez system, a operacje wyjścia to sygnały lub dane wysyłane z niego."
   },
   {
      "nr": 4,
      "pytanie": "Wymień i omów najważniejsze funkcje bezpieczeństwa informacji. ",
      "odpowiedz": "Funkcja bezpieczeństwa - kluczowa właściwość, jaką mechanizm bezpieczeństwa powinien zapewniać chronionym zasobom. \nPoszczególne mechanizmy mogą óżnić się zakresem oferowanych funkcji bezpieczeństwa oraz ich poziomem. \n● Uwierzytelnianie - proces polegający na potwierdzeniu zadeklarowanej tożsamości podmiotu biorącego udział w procesie komunikacji. Celem  uwierzytelniania jest uzyskanie określonego poziomu pewności, że dany podmiot jest w rzeczywistości tym, za który się podaje. \n● Niezaprzeczalność - brak możliwości wyparcia się swego uczestnictwa w całości lub w części wymiany danych przez jeden z podmiotów uczestniczących w tej wymianie. \n● Poufność - funkcja bezpieczeństwa wskazująca obszar, w którym dane nie powinny być udostępniane lub ujawniane nieuprawnionym osobom, procesom lub innym podmiotom. W bezpieczeństwie teleinformatycznym poufność realizowana jest zwykle przy pomocy szyfrowania oraz kontroli dostępu \n● Integralność - własność danych wykluczająca wprowadzenie do nich zmian w nieautoryzowany sposób. W technice informatycznej i telekomunikacyjnej ochrona integralności zapobiega przypadkowemu zniekształceniu danych podczas odczytu, zapisu, transmisji lub magazynowania. Wykorzystuje się tutaj sumy kontrolne (takie jak CRC) służące do detekcji błędów i kody korekcyjne do poprawy wykrytych błędów. \n● Dostępność - właściwość określająca, że zasób systemu teleinformatycznego jest możliwy do wykorzystania na żądanie, w założonym czasie, przez podmiot uprawniony do pracy w systemie teleinformatycznym \n● Rozliczalność - właściwość systemu pozwalająca przypisać określone działanie  w systemie do osoby fizycznej lub procesu oraz umiejscowić je w czasie. W bezpieczeństwie teleinformatycznym funkcja ta jest realizowana najczęściej za pomocą różnych form rejestrowania zdarzeń (logowania)."
   },
   {
      "nr": 5,
      "pytanie": "Programowanie obiektowe – podstawowe założenia.",
      "odpowiedz": "Programowanie obiektowe to paradygmat (wzorzec) programowania, którego założeniem jest tworzenie aplikacji tak, aby jak najlepiej odzwierciedlała rzeczywistość. Tworzony program składa się z obiektów. Klasa składa się z  pól i metod. Obiekt jest instancją klasy. \n• Abstrakcja, \n• Hermetyzacja, \n• Dziedziczenie, \n• Polimorfizm"
   },
   {
      "nr": 6,
      "pytanie": "Wymień podstawowe cechy oraz zastosowania języka modelowania UML. ",
      "odpowiedz": "UML to zunifikowany język modelowania. UML umożliwia modelowanie planowanej architektury systemu informatycznego na diagramie. Pomaga w wymianie informacji pomiędzy przyszłymi użytkownikami systemu, menadżerami, analitykami, projektantami, programistami i testerami. Ułatwia wykorzystanie zalet programowania obiektowego.\nZastosowania:\nSłuży do modelowania dziedziny problemu oraz graficznego opisywania założeń i zależności. \nStosuje się go w postaci różnych diagramów np. \n• Diagram klas- służy do pokazania klas i zależności między nimi \n• Diagram przypadków użycia- służy to zobrazowania usług dostępnych po stronie użytkownika\n• Diagram przepływu danych - służy do pokazania przepływu danych w aplikacji"
   },
   {
      "nr": 7,
      "pytanie": "Omów pojęcie złożoności algorytmów na wybranym przykładzie.",
      "odpowiedz": "Złożoność obliczeniowa algorytmu – ilość zasobów komputerowych potrzebnych do jego wykonania: \n ● Złożoność czasowa – to ilość czasu potrzebnego do ykonania zadania, wyrażona jako funkcja ilości danych. \n● Złożoność pamięciowa – to ilość pamięci potrzebnej do wykonania zadania, wyrażona jako funkcja ilości danych.  \nZłożoność algorytmu zależy także od formy danych, ich ułożenia, oraz ilości operacji jakie  trzeba wykonać by cel został osiągnięty. Są trzy możliwe ścieżki:  \n• Optymistyczna \n• Średnia (spodziewana) \n• Pesymistyczna  \nW przypadku algorytmu sortującego, ścieżka optymistyczna będzie gdy dane wejściowe są  już posortowane. Ścieżka spodziewana gdy część danych będzie nieposortowana, natomiast pesymistyczna gdy wszystkie elementy będą wymagały wykonana akcji. Przykładowo algorytm bubble sort posiada taką samą złożoność dla każdej ze ścieżek natomiast algorytmquick sort a różne złożoności dla różnych ścieżek."
   },
   {
      "nr": 8,
      "pytanie": "Modelowanie Systemów Informatycznych - cele, etapy, zasady.",
      "odpowiedz": "Modelowanie można określić jako próbę uchwycenia w kategoriach informatycznych i wyrażenia za pomocą specjalnej notacji graficznej najważniejszych cech rozwijanego systemu oraz jego otoczenia. Powstały w efekcie model ma umożliwić łatwe zaprojektowanie i implementację kodu. Cele: \n● ułatwienie organizacji: planowania, harmonogramowania, monitorowania przedsięwzięcia \n● odwzorowanie i transformacje pewnej myśli lub obserwowanych zachowań rzeczywistości \n● zebranie informacji o określonych obiektach i procesach postrzeganego środowiska, \n● sprawdzenie wiarygodności i realności celów systemu względem wartości i oczekiwań środowiskowych oraz skuteczności technologicznej \nEtapy: \n● analiza informacji z baz wiedzy \n● spisanie funkcjonalności systemu \n● opisanie zależności pomiędzy poszczególnymi częściami systemu \n● opis procesów systemu \n● analiza poprawności oraz działania Zasady: \n● modelowanie ma dostarczać tylko tyle informacji ile jest w danym momencie potrzebne"
   },
   {
      "nr": 9,
      "pytanie": "Przedstaw bayesowski algorytm rozpoznawania.",
      "odpowiedz": "Algorytm ten realizuje technikę klasyfikacji opartą na twierdzeniu Bayesa z założeniem niezależności predyktorów. \nMówiąc prościej, naiwny klasyfikator Bayesa zakłada, że obecność określonej cechy w klasie nie ma związku z obecnością jakiejkolwiek innej cechy.\nNa przykład owoc może być uważany za jabłko, jeśli jest czerwony, okrągły i ma około 7.5cm średnicy. Nawet jeśli te cechy zależą od siebie nawzajem lub od istnienia innych cech, wszystkie te właściwości niezależnie wpływają na prawdopodobieństwo, że ten owoc jest jabłkiem i dlatego algorytm ten jest znany jako „naiwny”.\nNaiwny model Bayesa jest łatwy do zbudowania i szczególnie przydatny w przypadku bardzo dużych zbiorów danych. Oprócz prostoty naiwny klasyfikator Bayesa jest znany z tego, że przewyższa nawet wysoce wyrafinowane metody klasyfikacji. \nAlgorytm: 1. Przekonwertuj zestaw danych na tabelę częstotliwości. \n2. Utwórz tabelę prawdopodobieństwa znajdując prawdopodobieństwa dla danych z tabeli częstotliwości. \n3. Użyj naiwnego równania Bayesowskiego do obliczenia prawdopodobieństwa a-posteriori (“po fakcie”, “na podstawie faktów”) dla każdej z klas. Klasa z najwyższym prawdopodobieństwem jest wynikiem"
   },
   {
      "nr": 10,
      "pytanie": "Normalizacja schematu bazy danych.",
      "odpowiedz": "Normalizacja to proces organizowania danych w bazie danych. Obejmuje to tworzenie tabel i ustanawianie relacji między tymi tabelami zgodnie z regułami zaprojektowanymi w celu zarówno ochrony danych, jak i zapewnienia większej elastyczności bazy danych przez wyeliminowanie nadmiarowości i niespójnych zależności. Normalizowanie bazy danych\n● Każda informacja jest przechowywana w osobnej kolumnie (np. adres podzielić na kolumny miasto, ulica, numer domu, województwo) \n● Stosowanie odpowiednich typów danych (daty, liczby z podziałem na rozmiary) \n● Tabele powinny przechowywać dane, które są w niej potrzebne i nazwa tabeli na nie wskazuje.\n● Korzystanie z kluczy obcych, pozwala przypisać wiele elementów do jednego bez konieczności dodawania każdorazowo kolumny oraz umożliwia wykorzystanie ich w innych  tabelach."
   },
   {
      "nr": 11,
      "pytanie": "Algorytm iteracyjny a rekurencyjny – omów różnice.",
      "odpowiedz": "Algorytm nazywany jest rekurencyjnym, gdy wywołuje siebie do momentu spełnienia warunku podstawowego.\n Algorytm jest nazywany iteracyjnym, gdy opiera się o użycie pętli, kończy się kiedy warunek pętli nie zostanie spełniony.\nRekurencyjny zużywa więcej pamięci, natomiast kod jest bardziej zwięzły, iteracyjny zużywa mniej pamięci, ale kodu jest więcej. "
   },
   {
      "nr": 12,
      "pytanie": "Własności wybranego sieciowego systemu operacyjnego (UNIX lub Windows).",
      "odpowiedz": "Windows Server posiada wbudowane technologie takie jak: \nActive Directory – usługa katalogowa \n∙ PowerShell - Program Windows PowerShell jest powłoką wiersza polecenia systemu Windows \n∙ Hyper-V – oprogramowanie stosowane do wirtualizacji fizycznych maszyn, komputerów. \n∙ Technologie Cloud i Windows-Container zapewniają zwiększoną wydajność i elastyczność \n∙ Nano Server \n∙ Zero Trust- metoda ochrony przed najnowszymi zagrożeniami \n∙ Storage Replica zapewnia ochronę prewencyjną na przypadek awarii \n∙ Usługa instalacji zdalnej \n∙ DFS (Distributed File System) -rozproszony system plików. \nSystem plików - Podstawowym systemem plików powszechnie używanym jest system NTFS. Struktura katalogów - Windows wykorzystuje strukturę 'drzewiastą'. Katalogi są uporządkowane wg. reguły 'pień' - 'konary'. Pień w domyśle tutaj jest główny katalog dysku twardego (C:). Konary to katalogi widoczne bezpośrednio pod katalogiem głównym (Moje dokumenty). Gałęzie w domyśle to wszystkie katalogi znajdujące się wewnątrz katalogów 'konarów' (Program Files/Adobe Reader)"
   },
   {
      "nr": 13,
      "pytanie": "Klasyfikacja i własności sieci komputerowych.",
      "odpowiedz": "Sieci komputerowe klasyfikujemy ze względu na: \n● Architekturę \n– Klient-serwer - występuje jeden lub kilka komputerów udostępniających usługi użytkownikom sieci zwane serwerami. Klient jest elementem końcowym korzystającym z udostępnianych przez serwer usług. \n– Równorzędną (p2p - peer to peer) - Wszyscy w sieci posiadają takie same prawa. Każdy może jednocześnie korzystać z zasobów oraz je udostępniać. (np. Torrenty) \n● Skalę \n– Sieć Lokalna (LAN) - zajmuje najmniejszy obszar. Może to być sieć domowa czy w pracowni. \n– Sieć Miejska (MAN) - zajmujące obszar miasta \n– Sieć Rozległa (WAN) - połączone ze sobą sieci LAN i MAN \n• Topologię \n– Magistrali - wszystkie urządzenia podłączone są do wspólnego medium transmisyjnego, najczęściej przewodu typu skrętka. Taka topologia ma ograniczoną przepustowość łącza, za to znacząco ogranicza koszty. \n– Pierścienia - Każde urządzenie jest podłączone do poprzedniego oraz do następnego po sobie, oraz końcowe urządzenia są ze sobą również połączone. Zaletą jest niewielka ilość okablowania, czy niewielki koszt. Wadą jest sytuacja, która w przypadku zerwania połączenia na dowolnym odcinku sieci skutkuje awarią całej sieci. \n– Podwójny pierścień - Taka sama zasada jak w przypadku pierścienia, jednak z dodatkowym awaryjnym zabezpieczeniem sieci w razie przerwania. \n– Gwiazdy - Urządzenia podpięte są do centralnego punktu stanowiącego dostęp do sieci (Switch). Zaletami są prostota w budowie, odporna na awarie. Wadami zaś wyższy koszt. \n– Gwiazdy rozszerzonej - posiada punkt centralny oraz dodatkowe punkty dostępowe. \n– Siatki - sieć zawiera połączenia nadmiarowe, które są wykorzystywane w razie awarii. Wykorzystywane w sieciach gdzie jest wymagana wysoka bezawaryjność. Wadą jest wysoki koszt \n• Rodzaj połączenia \n– Technologie kablowe \n∗ Skrętka \n∗ Kabel koncentryczny \n∗ Kabel światłowodowy \n– Technologie ezprzewodowe \n∗ Satelitarne usługi internetowe \n∗ Bezprzewodowa sieć lokalna (WIFI) \n∗ Bluetooth \n∗ Połączenie radiowe"
   },
   {
      "nr": 14,
      "pytanie": "Opisz typy kwerend w języku SQL.",
      "odpowiedz": "● Kwerendy Wybierające (SELECT) - służy do pobierania danych z tabel \n● Kwerendy parametryczne – po uruchomieniu kwerendy umożliwiają bezpośrednie wprowadzenie kryterium wyboru rekordów \n● Kwerendy Krzyżowe - Wykonywanie obliczeń oraz jednoczesna zmiana struktury danych w celu ich łatwiejszej analizy. Obliczają sumę, średnią, zliczają dane, grupują dane itp. \n● Kwerendy funkcjonalne: \n– Kwerendy tworzące tabele – Tworzą nową tabelę. \n– Kwerendy aktualizujące - Zmiana danych w tabelach \n– Dołączające - Dołączają rekordy z innych tabel \n– Usuwające - Usuwają rekordy spełniające dany warunek"
   },
   {
      "nr": 15,
      "pytanie": "Normalizacja schematu bazy danych.",
      "odpowiedz": "TCP/IP określany jest jako model protokołów. Każda z jego warstw wykonuje konkretne zadania, do realizacji który wykorzystuje konkretne protokoły. Model ISO/OSI natomiast zwany modelem odniesienia, stosowany jest raczej do analizy, która pozwala lepiej zrozumieć procesy komunikacyjne zachodzące w sieci oraz stanowi wzór do projektowania rozwiązań sieciowych zarówno sprzętowych i programowych. \nTCP/IP - 4 warstwy \n• aplikacji \n• transportu \n• internetowa \n• dostępu do sieci \nISO/OSI - 7 warstw \n• aplikacji \n• prezentacji \n• sesji \n• transportu \n• sieci \n• łącza danych \n• fizyczna \nOba modele są do siebie podobne, Różnice jakie występują widoczne są w górnych warstwach gdzie w przypadku modelu ISO/OSI dokonano podziału na 3 warstwy, a w modelu TCP/IP realizowane są przez jedną warstwę. Podobne różnice widać w dolnych warstwach gdzie w modelu ISO/OSI mamy dwie oddzielne warstwy łącza danych i fizyczną gdzie w modelu TCP/IP jest tylko warstwa dostępu do sieci."
   },
   {
      "nr": 16,
      "pytanie": "Usługi sieci Internet.",
      "odpowiedz": "WWW - jest to najpopularniejsza usługa dostępna w Internecie, polegająca na publikowaniu informacji w postaci stron internetowych oraz dołączanych do nich obrazów, multimediów, dokumentów. Pliki są umieszczane na serwerach, do których mają dostęp wszyscy użytkownicy Internetu lub tylko posiadający odpowiednie uprawnienia. \nPoczta elektroniczna (e-mail) - po założeniu konta e-mail uzyskuje się dostęp do usługi polegającej na przesyłaniu informacji tekstowych, tzw. listów elektronicznych, do innych użytkowników posiadających konto e-mail. \nFTP (ang. File Transfer Protocol - protokół transferu plików) - usługa ta umożliwia wymianę plików w sieci, między komputerami użytkowników a serwerami FTP. Jest to protokół typu klientserwer. Do transferu plików można wykorzystać przeglądarkę internetową lub jeden z wielu służących do tego programów. \nGrupy dyskusyjne - są internetowym odpowiednikiem 'tablic ogłoszeń', a których można zamieszczać różnego rodzaju informacje, dostępne dla wszystkich użytkowników. W celu ułatwienia wyszukiwania informacji są podzielone nadziały tematyczne, do których użytkownicy mogą się zapisywać. \nKomunikatory - umożliwiają prowadzenie bezpłatnej rozmowy w czasie rzeczywistym oraz obserwację statusu innych użytkowników. W odróżnieniu od czatów, grup dyskusyjnych i forów rozmowa odbywa się między dwojgiem użytkowników, a treść rozmowy nie jest dostępna dla pozostałych użytkowników \nP2P (ang. Peer to Peer - równy z równym) - usługa umożliwiająca takie łączenie komputerów między sobą, w którym obie strony są równorzędne. Programy P2P są wykorzystywane głównie do wymiany plików między użytkownikami, dostępne są także usługi dodatkowe, np. czaty lub fora. Idea P2P polega na tym, że każdy z użytkowników udostępnia pozostałym określone zasoby. \nSSH (ang. secure shell) - standard protokołów komunikacyjnych używanych w sieciach komputerowych TCP/IP, w architekturze klient-serwer a od wersji 2 nawet w architekturze serwerklient. W ścisłym znaczeniu SSH to tylko następca protokołu Telnet, służącego do terminalowego łączenia się ze zdalnymi komputerami. \nCzat - usługa oferowana przez większość portali internetowych, polegająca na wymianie wpisywanych z klawiatury informacji. Pozwala śledzić toczącą się rozmowę i włączać się do niej. \ne-bank - usługa dostępna obecnie w większości banków. Użytkownik do nowo zakładanego lub posiadanego już konta może otrzymać darmową usługę, polegającą na możliwości sprawdzania bieżącego salda rachunku, śledzenia operacji wykonywanych na rachunku, dokonywania przelewów czy wydruków stanu konta. \ne-learning - niezwykle dogodna forma zdobywania nowej, wiedzy."
   },
   {
      "nr": 17,
      "pytanie": "Grafika rastrowa – jej zalety, ograniczenia, przeznaczenie.",
      "odpowiedz": "Grafika rastrowa opisuje kolory obrazka punkt po punkcie (piksel po pikselu- RGB). \nZalety: \n● Bogactwo barw \n● Swobodne dobieranie kontrastu, nasycenia barw, jasności \n● Możliwość stosowania złożonych narzędzi do obróbki cyfrowych fotografii \n● Możliwość retuszu, korekcji, fotomontażu \nOgraniczenia: \n● Duża objętość plików \n● Obniżenie jakości przy skalowaniu \n● Niska jakość przy dużych powiększeniach \nZastosowanie: \n● branża fotograficzna - aparaty cyfrowe, czy też lustrzanki zapisują wykonane zdjęcia właśnie w formatach grafiki rastrowej. Popularne rozszerzenia można otworzyć bez specjalistycznego oprogramowania; \n● branża reklamowa - mowa tutaj w szczególności o wszelkich materiałach promocyjnych, takich jak np. ulotkach, broszurach, folderach, plakatach, katalogach; \n● branża poligraficzna - większość drukarni wymaga plików w formacie rastrowym, dotyczy to również wydruku zdjęć; \n● tworzenie stron internetowych - grafiki w formatach rastrowych doskonale sprawdzają się podczas projektowania i budowy stron internetowych. "
   },
   {
      "nr": 18,
      "pytanie": "Zasady i możliwości łączenia ze sobą różnych rodzajów sieci.",
      "odpowiedz": "Aby połączyć różne sieci, przede wszystkim musimy użyć urządzeń i medium transmisyjnego. Możemy zestawić połączenie między dwoma routerami. Jeśli mówimy o odległych sieciach zestawiamy je VPN Jeśli musimy zestawić dwie sieci w obrębie paru metrów, powinniśmy użyć odpowiedniego medium transmisyjnego, które zapewni nam odpowiednią przepustowość w sieci. \nMedia transmisyjne: \n● Skrętka \n● Kabel koncentryczny \n● Kabel światłowodowy \nUrządzenia odpowiedzialne za komunikację sieci: \n● Router - odpowiada za wyznaczanie trasy pakietów w sieci \n● Switch - służące do realizacji połączeń między komputerami w sieciach \n● AP (Access Point) - umożliwia utworzenie bezprzewodowe połączenie jako punkt dostępu w sieci komputerowej"
   },
   {
      "nr": 19,
      "pytanie": "Opisz koncepcję Internetu rzeczy (Internet of Things).",
      "odpowiedz": "Internet rzeczy jest terminem określającym jedną z nowszych koncepcji informatycznych. Polega ona na połączeniu materialnych przedmiotów ze sobą i z internetowymi zasobami za pomocą rozbudowanej sieci komputerowej – w tym przypadku jest nią oczywiście Internet. Koncepcja Internetu rzeczy nie obejmuje wyłącznie urządzeń, za pomocą których można się komunikować. Telefony czy komputery, które obecnie tworzą największą grupę przedmiotów wchodzących w skład tej struktury, w przyszłości będą mniejszością. Internet rzeczy z definicji obejmuje każdy przedmiot, który może zostać podłączony do ogólnoświatowej Sieci."
   },
   {
      "nr": 20,
      "pytanie": "Dwuwartościowa algebra Boole'a.",
      "odpowiedz": "Algebra Boole'a – struktura algebraiczna stosowana w matematyce, informatyce teoretycznej oraz elektronice cyfrowej. Działania na zmiennych (obiektach), które przyjmują jedynie dwie wartości: \n● w logice formalnej „prawda” lub „fałsz” (inaczej „T” lub „F”) \n● w systemach cyfrowych „włączony” lub „wyłączony” inaczej „1” lub „0” Wyrażenia boolowskie: \n● Podstawowe operatory: AND, OR, NOT \n● Operator Boole’a można zdefiniować przy pomocy tabeli lub matrycy prawdy (ang. truth table). \n● Operator AND nazywamy koniunkcją lub iloczynem logicznym \n● Operator OR nazywamy alternatywą lub sumą logiczną \n● Operator NOT nazywamy negacją lub zaprzeczeniem"
   },
   {
      "nr": 21,
      "pytanie": "Projektowanie cyfrowych układów kombinacyjnych.",
      "odpowiedz": "Połączone bramki logiczne, dające układy kombinacyjne za pomocą:\n1.tabeli prawdy\n2.schematów graficznych\n3.algebry boolea\nUkłady kombinacyjne - to układy cyfrowe, w których każda kombinacja sygnałów wejściowych określa jednoznacznie kombinację sygnałów wyjściowych. Kombinacja sygnałów wejściowych jest nazywana stanem wejść układu lub słowem wejściowym. Kombinacja sygnałów wyjściowych jest nazywana stanem wyjść układu lub słowem wyjściowym. \nW przypadku projektowania układów kombinacyjnych polecana jest metoda Karnaugha. \n1. Żeby z niej skorzystać najpierw należy wykonać mapę logiczną Karanugha. \n2. Gdy ja wykonamy trzeba zaznaczyć na mapie obszary w których funkcja posiada wartość 1. \n3. Zaznaczone obszary przyjmują przyległe wiersze i kolumny. \n4. Gdy już to mamy należy wyznaczyć funkcję dla sygnału x i dla sygnału y i na podstawie tego można już stworzyć bramki uniwersalne które będą wchodzić w skład naszej sieci. "
   },
   {
      "nr": 22,
      "pytanie": "Grafika wektorowa – jej zalety, ograniczenia, przeznaczenie.",
      "odpowiedz": "W grafice wektorowej każdy element obrazu jest opisany formułą matematyczną.\nZalety:\n● skalowalność\n● prostota opisu\n● możliwość zmiany parametrów obrazu\n● dobra konwersja do grafiki rastrowej\nOgraniczenia:\n● przy dużej liczbie obiektów plik staje się proporcjonalnie większy\n● im więcej szczegółów zawiera obraz, tym więcej pamięci zostanie użytej do modyfikacji pliku\nPrzeznaczenie:\n● logo, herby, flagi, godła\n● schematy naukowe i techniczne\n● mapy i plany\n● różnego typu znaki, np. drogowe\n● część graficznej twórczości artystycznej (np. komiksy)"
   },
   {
      "nr": 23,
      "pytanie": "Charakterystyka podstawowych elementów układów cyfrowych.",
      "odpowiedz": "Bramki logiczne są podstawowymi elementami, z których zbudowane są układy cyfrowe – wykonują one proste operacje logiczne na wejściach. Najważniejsze typy bramek logicznych to: \n● NOT (jedno wejście): daje 1, gdy na wejściu jest 0. \n● AND (dwa lub więcej wejść): daje 1, gdy na wszystkich wejściach jest 1. \n● OR (dwa lub więcej wejść): daje 1, gdy na którymś wejściu jest 1. \n● NAND (dwa lub więcej wejść): daje 0, gdy na wszystkich wejściach jest 1. \n● NOR (dwa lub więcej wejść): daje 0, gdy na którymś wejściu jest 1. \n● XOR (dwa wejścia): daje 1, gdy na dokładnie jednym wejściu jest 1. Bramki NAND oraz NOR są bramkami podstawowymi – jeśli umiemy zrobić bramkę NAND (lub bramkę NOR), możemy z odpowiedniej liczby takich bramek poskładać dowolny układ logiczny. Bardzo często spotykanymi blokami w konstrukcji układów logicznych są multipleksery (zwane w skrócie MUXami). Multiplekser to blok, który ma dwa rodzaje wejść (INPUT i SELECT) oraz jedno wyjście. Wejścia SELECT wybierają jedno z wejść INPUT, którego stan będzie skopiowany na wyjście. \nDo trzymania stanu wewnętrznego służą bloki sekwencyjne: przerzutniki i zatrzaski. We współczesnych układach praktycznie jedynym typem używanych bloków sekwencyjnych są przerzutniki typu D. "
   },
   {
      "nr": 24,
      "pytanie": "Przedstaw koncepcję sortowania metodą prostej zamiany oraz quicksort",
      "odpowiedz": "Sortowanie metodą prostej zamiany (bąbelkowe) - Polega na tym iż przez zbiór przechodzi pętla, która porównuje dwie sąsiadujące liczby, po czym porównuje dwie kolejne aż do końca zbioru. Po przejściu całego zbioru pętla powtarza się do momentu kiedy nie podmieni żadnego elementu. \nQuick Sort - Jest bardziej skomplikowane ale za to jest szybsze. Jego idea polega na podzieleniu zbioru na mniejsze zbiory. Następnie wybierana jest wartość ok. środka zbioru, po czym elementy większe niż wyznaczony środek przenoszone są na jedną stronę a mniejsze na drugą. Wynikiem tego są dwa zbiory które analogicznie się dzieli i przenosi. Operacje wykonuje się do momentu gdy zbiory zostają z jedną wartością."
   },
   {
      "nr": 25,
      "pytanie": "Opisz algorytmy planowania kolejką do procesora.",
      "odpowiedz": "Algorytmy planowania niewywłaszczającego: \n● FCFS - Procesy utrzymują procesor w kolejności, w jakiej zgłosiły się do systemu. \n● LCFS - Obsługuje procesy w kolejności odwrotnej do kolejności zgłoszeń \n● SJF - preferuje procesy, które mają najmniejsze wymagania odnośnie czasu procesora, potrzebnego na realizację przetwarzania (najpierw zadanie z najkrótszą fazą procesora) Algorytmy planowania wywłaszczającego: \n● Algorytm rotacyjny - Każdy proces jest co najwyżej przez pewien okres czasu, po czym następuje przełączenie kontekstu na inny proces. Po jakimś czasie nastąpi wznowienie procesu przerwanego. Proces może przed upływem kwantu czasu zgłosić żądanie zasobowe, zrezygnować dobrowolnie z procesora lub zakończyć się, co skutkuje przydzieleniem nowego kwantu dla następnego procesu. W planowaniu rotacyjnym wszystkie procesy mają ten sam priorytet. \n● SRT - najpierw zadanie, które ma najkrótszy czas do zakończenia."
   },
   {
      "nr": 26,
      "pytanie": "Opisz system z obsługą przerwań.",
      "odpowiedz": "Mechanizm przerwań służy informowaniu o zdarzeniach zachodzących w urządzeniach wejścia/wyjścia. Typowe takie zdarzenia to zakończone zleconej operacji wejścia/wyjścia oraz zdarzenia zewnętrzne, takie jak naciśnięcie klawisza na klawiaturze, ruch myszki, czy otrzymanie przez sieć pakietu danych. W momencie zajścia zdarzenia urządzenie generuje sygnał przerwania. W odpowiedzi na ten sygnał procesor przerywa wykonywanie aktualnie wykonywanego ciągu instrukcji, zapamiętuje na stosie systemowym adres określający gdzie przerwano wykonywanie instrukcji i wykonuje określoną procedurę obsługi przerwania. Po jej zakończeniu następuje powrót do przerwanego ciągu instrukcji. Przerwania powodowane przez urządzenia wejścia/wyjścia są nazywane przerwaniami sprzętowymi. Możliwe jest równie programowe wywołanie przerwań w przypadku której procedura przerwania generowana jest z kodu programu. Istnieje wiele możliwych przerwań. W jaki sposób jedne przerwania są odróżniane od innych? \nStosowane są dwa rozwiązania: \n● Odpytywanie polega na tym, że procedura obsługi przerwania pyta się kolejno wszystkich urządzeń, czy to nie one spowodowały przerwanie - rozwiązanie to jest stosowane wówczas gdy mamy tylko jeden rodzaj przerwań. \n● Wektor przerwań - w systemie może być wiele rozmiarów przerwań, a każdemu rodzajowi odpowiada osobna procedura obsługi. Adresy tych procedur są przechowywane w tablicy systemowej nazywanej wektorem przerwań. Rozwiązanie to jest bardziej efektywne niż odpytywanie."
   },
   {
      "nr": 27,
      "pytanie": "Omówić na przykładzie układy z zastosowaniem mikroprocesorów AVR ATmega.",
      "odpowiedz": "Jako przykład mogę podać popularne układy Arduino, które składają się m. in. z mikroprocesora AVR. Pozwalają one w łatwy sposób tworzyć mniej lub bardziej skomplikowane układy. Ze względu na swoją prostotę Arduino było kierowane do osób odpowiedzialnych za modyfikacje scen teatralnych, przez co jego obsługa miała być intuicyjna oraz umożliwiać wykonywanie prostych czynności. Dodatkowo dzięki Arduino nie trzeba przygotowywać specjalnej płytki do podłączenia, oraz można wykorzystać gotowe moduły tzw. Shieldy. Ze względu na małe rozmiary może znaleźć zastosowanie także w innych dziedzinach. "
   },
   {
      "nr": 28,
      "pytanie": "Architektura von Neumanna oraz mikroprocesorów RISC i CISC – wady i zalety",
      "odpowiedz": "Architektura Von-Neumanna - cechuje się jednolitą przestrzenią adresową, w której wszystkie pamięci, rejestry i układy we/wy są umieszczone w jednej, wspólnej przestrzeni adresowej. Dane przechowywane są wspólnie z instrukcjami. \nW tej architekturze komputer składa się z czterech głównych komponentów: \n● Pamięci komputerowej przechowującej dane programu oraz instrukcje programu. Każda komórka pamięci ma unikatowy identyfikator nazywany jej adresem \n● Jednostki sterującej odpowiedzialnej za pobieranie danych i instrukcji z pamięci oraz ich sekwencyjne przetwarzanie. \n● Jednostki arytmetyczno-logicznej odpowiedzialnej za wykonanie podstawowych operacji arytmetycznych. \n● Urządzenia wejścia/wyjścia służących do interakcji z operatorem Procesory typu CISC ( Compound Instruction Set Computer - komputery o złożonej liście rozkazów) Cechy architektury CISC: \n● duża liczba rozkazów (instrukcji) (często powyżej 100), występują instrukcje wspierające języki wysokiego poziomu - łatwiejszy w programowaniu \n● mała optymalizacja cykli rozkazowych \n● występowanie złożonych, specjalistycznych rozkazów, które współpracują na ogół tylko z określonymi rejestrami i wymagają stosowania określonych trybów adresowania, \n● duża liczba trybów adresowania \n● do pamięci może się odwoływać bezpośrednio duża liczba rozkazów, \n● mniejsza od procesorów RISC częstotliwość taktowania procesora, \n● powolne działanie dekodera rozkazów \nProcesory typu RISC ((Reduced Instruction Set Computing) mają następujące cechy architekturalne: \n● Ograniczona lista rozkazów, \n● Rozkazy wewnętrznych mają prostą treść operacyjną \n● Mała liczba trybów adresowania dostępna w rozkazach wewnętrznych \n● Duża liczba rejestrów roboczych w procesorze \n● Ujednolicony czas wykonania rozkazów - od jednego do kilku cykli zegara. \n● Układ sterowania procesora jest sprzętowy"
   },
   {
      "nr": 29,
      "pytanie": "Systemy wykrywania i zapobiegania włamaniom (IDS, IPS).",
      "odpowiedz": "IDS (Intrusion Detection System) odpowiada za wykrywanie prób ataków na infrastrukturę sieciową. Ich zadaniem jest wykrycie takiego zdarzenia i poinformowanie o tym odpowiednich osób. IDS są wykorzystywane do uzupełnienia całości dobrze zorganizowanego systemu bezpieczeństwa, na który oprócz nich powinny się składać m.in: \n● polityka bezpieczeństwa \n● szyfrowanie danych \n● weryfikacja użytkowników \n● kontrola dostępu \n● zapory sieciowe \nIPS (Intrusion Prevention System) jest systemem, który nie tylko wykrywa, ale również zapobiega włamaniom i chroni przed nimi infrastrukturę sieciową. W największym uproszczeniu można stwierdzić, że IPS to IDS połączony z zaporą sieciową. Razem tworzą kompleksowy i zintegrowany system wykrywania oraz reagowania na niepożądane wtargnięcia zachodzące w infrastrukturze sieciowej."
   },
   {
      "nr": 30,
      "pytanie": "Typy zapór sieciowych.",
      "odpowiedz": "Zapora ogniowa (ang. firewall) – sprzętowe lub programowe narzędzie bezpieczeństwa, które kontroluje ruch do i z sieci. \n● Zapory filtrujące – monitorują przepływające przez nie pakiety sieciowe i przepuszczają tylko zgodne z regułami ustanowionymi na danej zaporze (zapora pracująca dodatkowo jako router). \n● Translacja adresów sieciowych (ang. network address translation, NAT) – polega na dokonywaniu zmiany adresu IP hosta wewnętrznego w celu ukrycia go przed zewnętrznym monitorowaniem. Mechanizm ten jest również nazywany maskowaniem adresu IP. \n● Zapory pośredniczące (proxy) – wykonujące połączenie z serwerem w imieniu użytkownika. Przykładowo, zamiast uruchomienia sesji http bezpośrednio do zdalnego serwera WWW, uruchamiana jest sesja z zaporą i dopiero stamtąd uruchamiane jest połączenie z systemem zdalnym. Cała komunikacja na serwer http przechodzi przez serwer pośredniczący (proxy), które może filtrować ruch."
   },
   {
      "nr": 31,
      "pytanie": "Wzorzec architektoniczny MVC w wykonaniu aplikacji internetowych",
      "odpowiedz": "MVC to najpopularniejszy wzorzec architektoniczny stosowany przy tworzeniu aplikacji internetowych. Jego głównym celem jest rozdzielenie zależności aplikacji na trzy grupy: \n● Model - Część aplikacji odpowiedzialna za reprezentację danych. Zwykle modele łączy się z możliwością pobierania danych. Dane do modelu można pobierać z różnych źródeł zależnie od wymagań aplikacji. Dane mogą pochodzić z bazy danych, plików czy prosto z kodu. Model powinien posiadać podstawową logikę biznesową dlatego powinno móc się wywoływać konkretne metody dotyczące danego modelu. \n● View - warstwa prezentacji. Jest to warstwa prezentująca ale również umożliwiająca interakcje z systemem. Widok najczęściej utożsamiany jest z HTML jednakże warstwą prezentacji może być cokolwiek rozumie użytkownik np. JSON. \n● Controller - Jest częścią aplikacji która odpowiada za obsługę zapytań. Jego podstawowym założeniem jest przyjęcie zapytania oraz zwróceniu mu odpowiedzi. "
   },
   {
      "nr": 32,
      "pytanie": "Generatory liczb losowych, zastosowanie w symulacji. ",
      "odpowiedz": "Generatory liczb losowych - program komputerowy lub układ elektroniczny generujące losowy ciąg elementów binarnych zorganizowanych zwykle jako ciąg liczb losowych. Generatory liczb losowych są ważnymi współczesnymi narzędziami badawczymi, używanymi w wielu dziedzinach, m.in. w kryptografii, statystyce do symulacji procesów(przybliżone obliczenia matematyczne i symulacje fizyczne przy użyciu metody Monte Carlo). \nZastosowanie w symulacji: •\n• Lotnictwo \n• Elektronika \n• Meteorologia - prognozy pogody \nGeneratory liczb losowych można wykorzystać do symulowania danych sytuacji w których wartości zmiennych są przekładane na wynik. Jako przykład można podać program który zwraca różne wyniki zależne od podanych wartości. Generatory liczb losowych generują duże ilości różnych danych przez co można sprawdzić jak program zachowa się dla takich danych oraz czy nie wystąpi błąd w jego działaniu."
   },
   {
      "nr": 33,
      "pytanie": "Technologie asynchronicznego dostępu do serwera, przykład wykorzystania AJAX.",
      "odpowiedz": "Wykonywanie asynchronicznych zapytań do serwera ma na celu wykonanie jakiejś operacji bez konieczności odświeżania strony przez użytkownika. Większość aktualnych frameworków frontendowych opiera się na wykonywaniu takowych operacji. Jako przykład użycia można podać aplikację internetową typu SPA (single page application). Aplikacje tego typu dynamicznie przełączają widoki a zapytania do serwera wykonywane są asynchronicznie co pozwala na korzystanie z aplikacji bez konieczności ciągłego przeładowywania strony. "
   },
   {
      "nr": 34,
      "pytanie": "Wyjaśnij pojęcie Projektowanie zorientowane na użytkownika (User Centered Design)",
      "odpowiedz": "Projektowanie zorientowane na użytkownika - podejście do programowania interakcji człowieka z komputerem, w którym potrzeby, wymagania i ograniczenia końcowego użytkownika są szczegółowo analizowane na każdym etapie procesu projektowania. \nCel \nProjektowanie skupione na użytkowniku skupia się na zadawaniu pytań dotyczących użytkownika, jego emocji, celów i zadań. Dzięki odpowiedzią na takie pytania projektant może stworzyć projekt aplikacji która będzie odpowiadać potrzebom potencjalnych klientów. \nEtapy \nSą cztery etapy powtarzane cykliczne do momentu osiągnięcia konkretnych rezultatów (każdy etap powinien przebiegać z udziałem użytkowników). Kolejne cykle dostarczają projektantom nowych informacji o produkcie oraz ich potencjalnych użytkownikach. \n● Obserwacja - celem jest zrozumienie problemu docelowej grupy użytkowników, do których kierowany jest produkt. Celem jest obserwacja potencjalnych klientów w ich naturalnym środowisku oraz w sytuacjach w których mogli by wykorzystać projektowany dla nich produkt. \n● Generowanie pomysłów - to proces polegający na wymyśleniu jak największej liczby potencjalnych rozwiązań po uprzedniej analizie wytycznych \n● Opracowanie prototypu - stworzenia makiety bądź prototypu potencjalnych rozwiązań w celu ich testowania z użytkownikami \n● Testowanie - polega na obserwacji docelowej grupy użytkowników, którzy posługują się prototypem/makietą. Ważne jest by wiarygodnie odwzorować rzeczywisty kontekst użycia produktu. "
   },
   {
      "nr": 35,
      "pytanie": "Scharakteryzuj termin Architektura Informacji.",
      "odpowiedz": "Architektura informacji (AI) dotyczy tworzenia i przedstawiania informacji (tekstowych oraz graficznych) w sposób czytelny i intuicyjny dla odbiorcy. Organizacja treści to grupowanie ich w odpowiednie kategorie oraz ich odpowiednie nazywanie, nadawanie im hierarchii, tworzenie przejrzystej nawigacji, umieszczanie odpowiednich grup treści w intuicyjnie kojarzonych do tego miejscach."
   },
   {
      "nr": 36,
      "pytanie": "Opisz zasady tworzenia oraz wykorzystania diagramów związków-encji (ERD)",
      "odpowiedz": "Poniżej przedstawiona jest metoda tworzenia diagramów ERD jako proces składający się z pięciu kroków: \n1. Identyfikacja zbioru obiektów, o których informacje są istotne; Identyfikację obiektów rozpoczynamy od wyodrębnienia kluczy głównych poszczególnych obiektów, czyli identyfikatorów jednoznacznie identyfikujących obiekt. Wyróżnione identyfikatory pozwalają na uformowanie wstępnej listy obiektów; \n2. Określenie związków zachodzących pomiędzy obiektami oraz rodzaju związków; Identyfikacja bezpośrednich zależności pomiędzy obiektami, które odzwierciedlają pewne reguły przyjęte w firmie. Należy zbadać istnienie bezpośrednich powiązań między wszystkimi parami obiektów w systemie;\n3. Identyfikacja atrybutów obiektów; Po wyodrębnieniu istotnych obiektów oraz związków zachodzących pomiędzy nimi można uzupełnić opis obiektów identyfikując potrzebne atrybuty tzn. dane istotne dla firmy opisujące konkretny obiekt; \n4. Stworzenie wstępnego modelu pojęciowego; \n5. Sprawdzenie poprawności otrzymanej struktury. \nW zależności od poziomu abstrakcji ERD może służyć do: \n● Opisu położenia danych w systemie na wysokim poziomie abstrakcji \n● uniezależnienia danych od procesów na nich operujących \n● wyróżnienia związków pomiędzy zbiorami danych \n● baza danych - ERD służy do analizy powiązań i zależności pomiędzy poszczególnymi tabelami oraz usuwania problemów z tym związanych (np. redundancji danych) "
   },
   {
      "nr": 37,
      "pytanie": "Estymowanie projektów informatycznych, jego kosztów oraz czasu realizacji.",
      "odpowiedz": "Estymowanie projektu polega na określeniu przybliżonej jego złożoności. Podczas estymacji można mniej więcej określić koszt wykonania projektu oraz jego poszczególnych części składowych. Pozwala także w przybliżeniu określić czas potrzebny na stworzenie takiego projektu estymując poszczególne elementy systemu oraz sumując ilość estymowanych godzin. \nJako zmienne przy estymowania projektu są różnorakie czynniki, które wpływają na sam projekt. Mogą to być: \n● koszty i czas związany z dodatkowym szkoleniem pracowników, \n● koszty z koniecznością rozbudowy sprzętu na rzecz projektu, \n● doświadczenie pracowników oraz ich wydajność \n● rodzaj projektu \n● margines bezpieczeństwa "
   },
   {
      "nr": 38,
      "pytanie": "Opisz zasady stosowania techniki Wezwania do działania (Call to action). ",
      "odpowiedz": "Call To Action to element który ma spowodować wykonanie na użytkowniku pożądanej akcji. Zwykle stosowany w marketingu do zachęcenia klienta do skorzystania z usługi bądź kupienia produktu. Jako przykład może posłużyć przycisk KUP TERAZ na Allegro. W przypadku elementów Call To Action, tekst, kolor oraz dodatkowe efekty muszą być dobrane tak aby wyróżniały się na stronie oraz przykuwały uwagę użytkownika, ale także pasowały do całokształtu. Booking.com jako Call To Action wykorzystał krótki napis mówiący o tym że został ostatni pokój, to ogłoszenie przegląda jeszcze n osób które mają wywołać na kliencie presję, że ktoś może wynająć pokój, którym się interesuje przed nim przez co przegapi okazję."
   },
   {
      "nr": 39,
      "pytanie": "Omów pojęcie Strona docelowa (Landing Page), wymień powody jej stosowania oraz elementy odróżniające ją od zwykłej strony internetowej. ",
      "odpowiedz": "Landing Page to prosta strona docelowa, w której użytkownik ma przestawiony jeden bądź małą grupę produktów zgodną z tematyką. Ma on na celu skupienie uwagi użytkownika na danych produktach nie rozpraszając go natłokiem innych produktów oferowanych przez firmę. Zwykle Landing Page nie jest umieszczony na głównej stronie lecz na osobnej sub domenie z ograniczonym interfejsem i treścią w celu przekonania klienta do stricte danego produktu. Dodatkowo jest często łączone z Call To Action by sprowokować użytkownika do wykonania danej akcji. "
   },
   {
      "nr": 40,
      "pytanie": "Symulacja systemów obsługi masowej. Podać przykłady. ",
      "odpowiedz": "Systemy masowej obsługi (lub kolejkowe) występują w wielu praktycznych sytuacjach, np. samoloty na lotnisku oczekują na start lub lądowanie, klienci czekają w kolejce na swoją kolej, drukarka posiada kolejkę wydruków. Wynikiem analizy takich systemów jest ustalenie optymalnej liczby stanowisk obsługi lub zasady wyboru zgłoszeń oczekujących w kolejce do obsługi. Celem może być zapewnienie przez system założonego średniego czasu oczekiwania na obsługę lub określonej długości kolejki. Ze względu na fakt, że dokładne czasy przybycia zadań do systemu, jak i czasy obsługi zadań przez system nie są znane a priori przyjmuje się, że są one zmiennymi losowymi i analizuje się je za pomocą modeli niedeterministycznych "
   },
   {
      "nr": 41,
      "pytanie": "Opisz zadanie interpolacji wielomianowej oraz podaj przykłady jego rozwiązania.",
      "odpowiedz": "Interpolacja wielomianowa ma za zadanie wyznacznie obliczenia wartości w dowolnym punkcie\nPrzykłady\n- wzór interpolacji Newtona\n- suma iloczynów - metoda Lagrange'a\nInterpolacja wielomianowa umożliwia wyznaczanie wzorów przybliżonych stosowanych do obliczania wartości funkcji w dowolnym punkcie, przy założeniu, że znane są wartości tej funkcji w skończonej liczbie punktów.Zadanie Przykłady rozwiązania są następujące: Można użyć wzoru interpolacji Newtona, wykorzystującego ilorazy różnicowe i na ich podstawie wyznaczyć wielomian. Albo użyć metody Lagrange’a jako sumy iloczynów pewnych wielomianów."
   },
   {
      "nr": 42,
      "pytanie": "Układy dynamiczne i programy do ich symulacji. Podać prosty przykład układu dynamicznego. ",
      "odpowiedz": "Matematyczny model, w którym znany jest stan poczatkowy\nNajcześciej wyznaczant przez równanie różniczkowe [tornada; matlab]\nUkład dynamiczny: model matematyczny rzeczywistego zjawiska przyrody, którego ewolucja jest wyznaczona jednoznacznie przez stan początkowy. Najczęściej jest opisany pewnym wektorowym równaniem różniczkowym \nProgram: MatLab z wykorzystaniem simulink do prezentacji graficznej układu dynamicznego \nPrzykład: Symulowanie zachowań tornad, ze względu na obserwację tornad, powstał ich model matematyczny przedstawiający ich zachowanie oraz umożliwiający obliczanie siły oraz kierunku jego podążania."
   },
   {
      "nr": 43,
      "pytanie": "Omów założenia SOLID.",
      "odpowiedz": "Założenia SOLID mają na celu ukazanie pięć bazowych zasad tworzenia czystego oraz jakościowego kodu. Każda z liter oznacza jedna zasadę \nS - Zasada pojedynczej odpowiedzialności (ang. Single-Responsibility Principle – SRP), Klasa powinna mieć tylko jedną odpowiedzialność (nigdy nie powinien istnieć więcej niż jeden powód do modyfikacji klasy). \nO - Zasada otwarte – zamknięte (ang. Open/Closed Principle – OCP), Klasy (encje) powinny być otwarte na rozszerzenia i zamknięte na modyfikacje. \nL - Zasada podstawiania Liskov (ang. Liskov Substitution Principle – LSP), Funkcje które używają wskaźników lub referencji do klas bazowych, muszą być w stanie używać również obiektów klas dziedziczących po klasach bazowych, bez dokładnej znajomości tych obiektów. \nI - Zasada segregacji interfejsów (ang. Interface Segregation Principle – ISP), Wiele dedykowanych interfejsów jest lepsze niż jeden wielki. \nD - Zasada odwracania zależności (ang. Dependency Inversion Principle – DIP). Wysokopoziomowe moduły nie powinny zależeć od modułów niskopoziomowych - zależności między nimi powinny wynikać z abstrakcji. "
   },
   {
      "nr": 44,
      "pytanie": "Omów zasady tworzenia czystego kodu.",
      "odpowiedz": "● Prostsze jest zawsze lepsze - zredukuj złożoność na ile to jest możliwe. \n● Używaj wstrzykiwania zależności - strukturalny wzorzec projektowy wykorzystywany do tworzenia i zarządzania luźno powiązanymi zbiorami klas. Jego podstawowym założeniem jest usunięcie bezpośrednich zależności między klasami, a udostępnienie drogi na przekazywanie bardziej elastycznych i otwartych na zmiany alternatyw. \n● konsekwentność w nazewnictwie \n● warto nazywać zmienne w taki sposób, aby na pierwszy rzut oka było wiadomo, co reprezentują \n● DRY - nie powtarzać kodu \n● Funkcja: mała, robiąca jedną konkretną rzecz, \n● Testy: czytelne, niezależne, szybkie, powtarzalne, jedna asercja na test \n● kod ma się sam opisywać \n● czytelność kodu (odpowiednie wcięcia, łamanie kodu w dobrych miejscach, odpowiednie przerwy między metodami)"
   },
   {
      "nr": 45,
      "pytanie": "Wzorce projektowe: idea, podział, przykłady zastosowań.",
      "odpowiedz": "Wzorzec projektowy (ang. Design pattern) – w inżynierii oprogramowania, uniwersalne, sprawdzone w praktyce rozwiązanie często pojawiających się, powtarzalnych problemów projektowych. Pokazuje powiązania i zależności pomiędzy klasami oraz obiektami. Wzorzec projektowy nie jest gotową implementacją rozwiązania, lecz jego opisem. \nPodział: \n● Kreacyjne - opisują proces tworzenia nowych obiektów \n– Budowniczy - wzorzec pozwala na podział skomplikowanego procesu tworzenia obiektu na kilka mniejszych etapów gdzie każdy z nich może być implementowany na różne sposoby. \n● Strukturalne - Opisujące struktury powiązanych ze sobą obiektów \n- Kompozyt - Pozwala traktować grupę obiektów jako  pojedynczy obiekt. Dzięki temu operacje na grupie obiektów wykonujemy w takim sam sposób, jakbyśmy wykonywali je na pojedynczym obiekcie. \n● Czynnościowe - opisujące zachowanie i odpowiedzialność współpracujących ze sobą obiektów. \n- Obserwator - pozwala na obserwowanie wykonywanych operacji na danym obiekcie. Podczas wywoływania odpowiedniej funkcji danego obiektu wykonuje się odpowiednia operacja zaprogramowania do obsłużenia danego przypadku."
   },
   {
      "nr": 46,
      "pytanie": "Programowanie ekstremalne: idea, zalecenia, przykłady zastosowań.",
      "odpowiedz": "Programowanie ekstremalne - paradygmat i metodyka programowania mające na celu wydajne tworzenie małych i średnich projektów wysokiego ryzyka czyli takich, w których nie do końca wiadomo co się robi i jak to się powinno prawidłowo zrobić. Przyświeca temu koncepcja prowadzenia projektu informatycznego, wywodząca się z obserwacji innych projektów, które odniosły sukces. \nZalecenia: \n● Iteracyjność - Planowanie pracy na krótki odcinek czasu. Taka jedna iteracja powinna wygenerować już jakiś minimalny produkt, który można wdrożyć i można z niego korzystać. \n● Nie projektować z góry architektury systemu - po prostu będzie się rozwijać wraz z systemem \n● Pisanie testów przed implementacją - piszemy test a dopiero potem kod który ma spełniać warunki tego testu \n● Ciągłe modyfikacje architektury - można zmieniać architekturę jeżeli ułatwi przejście iteracji a zarazem nie zepsuje wyników poprzednich iteracji. \n● Programowanie parami - programiści piszą w parach: jedna osoba pracuje przy klawiaturze i jest głównym koderem, druga obserwuje pierwszą, zgłasza poprawki, zadaje pytania wyjaśniające. Programiści programujący w parze zamieniają się rolami co kilkadziesiąt minut. Ta technika umożliwia wyłapanie wielu błędów oraz wzajemną naukę. \n● Stały kontakt z klientem - Specyfikacje są prawie zawsze wieloznaczne, dziurawe i sprzeczne ze sobą. Tak więc należy mieć stały kontakt z tym, dla kogo to oprogramowanie jest tworzone (klient zamawiający program, czy też użytkownicy końcowi). Jeśli kontakt jest dobry, można się nawet obyć bez specyfikacji. \nZastosowania: \n- Gdy spodziewa się zmiany funkcjonalności systemu co kilka miesięcy \n- Gdy doświadcza się stale zmieniających się wymagań lub pracy z klientami, którzy nie są pewni czego chcą aby system wykonywał \n- Gdy chce się oddalić ryzyko projektu, zwłaszcza przy nadchodzących deadlinach \n- Mała liczba programistów (preferowane od 2 do 12)"
   },
   {
      "nr": 47,
      "pytanie": "Opisać pojęcie RAD (Rapid Application Development), jego wady oraz zalety",
      "odpowiedz": "Ogólnie rzecz biorąc, podejścia RAD do tworzenia oprogramowania kładą mniejszy nacisk na planowanie, a większy na proces adaptacyjny. Prototypy są często stosowane w uzupełnieniu specyfikacji technicznych, a czasem nawet w ich miejscu. \nZalety: \n● umożliwia to uzyskanie pewnego efektu już w pierwszych krokach programistycznych \nWady: \n• szybkie oznacza często obniżenie standardów niezawodności, efektywności, jakości oprogramowania \n• zależność od zastosowanych komponentów może prowadzić do kłopotów z ewolucją oprogramowania, kosztami użytkowania, czasem do problemów prawnych \n• stosowanie gotowych komponentów często prowadzi do niekompatybilności wymagań – nie są realizowane żądane cechy, natomiast pojawiają się inne niepotrzebne \n• programy stają się zbyt podobne jedne do drugich"
   },
   {
      "nr": 48,
      "pytanie": "Internetowe bazy danych w wykonaniu technologii PHP/MySQL",
      "odpowiedz": "PHP umożliwia połączenia z bazami danych MySQL. Daje to możliwość korzystania z danych zawartych w bazie danych, np. dane użytkowników, bądź inne dane potrzebne w przypadku projektu. Daje to możliwość tworzenia rozszerzonych aplikacji wykorzystujących te dane, bądź generujące na ich podstawie wykresy bądź analizy danych lub rozwiązujące jakiś problem. Pozwala to także na tworzenie szablonów stron, gdzie  treść strony może być zależna od wartości z bazy danych."
   },
   {
      "nr": 49,
      "pytanie": "Opisać role w zespole programistycznym, metody komunikacji w zespole",
      "odpowiedz": "● Project Manager - kierownik projektu, jego zadaniem jest zorganizowanie projektu, zarządzanie zadaniami, dokumentacją, przepływem informacji, odpowiada za komunikację wewnątrz zespołu oraz za komunikację z klientem oraz rozwiązuje konflikty. \n● Analityk biznesowy - będzie istotnym wsparciem w trakcie wybierania rozwiązań, określania celów i pomoże nadać projektowi odpowiedni kierunek. \n● UI/UX Designer - UI (User Interface) Designer, czyli zajmuje się wyglądem i projektem interfejsu użytkownika oraz identyfikacją wizualną. Z kolei UX (User Experience) Designer - do jego zadań należy badanie ludzi z grupy docelowej, zbieranie informacji i ich analiza, a następnie  aprojektowanie ścieżek użytkowników. \n● Architekt systemu - Zwykle jest to najbardziej doświadczony programista, który będzie dbał o całokształt systemu, jakość kodu, wybierał technologie, rozwiązania i najlepsze narzędzia. \n● Programiści - Role w zespole programistów zwykle dzielą się na Frontend i Backend Developerów. Jedna z nich zajmuje się stroną oprogramowania, z którą interakcję prowadzi użytkownik, a druga odpowiada za logikę systemu, serwery i bazy danych. \n● Testerzy - mają na celu wykrycie wszelkich błędów, słabości czy wad produktu, dzięki  czemu można później podjąć działania, które rozwiążą zaistniałe problemy. \nMetody komunikacji w zespole to: \n- daily \n- slack \n- baza wiedzy - tam znajdują się wszystkie informacje o projektach i zadaniach \n- Kanban - wizualizuje wszystkie zadania w projekcie"
   },
   {
      "nr": 50,
      "pytanie": "Opisać zasady metodyki Agile w odniesieniu do informatycznych projektów deweloperskich.",
      "odpowiedz": "Wytwarzając oprogramowanie i pomagając innym w tym zakresie, odkrywa się lepsze sposoby wykonywania tej pracy. W wyniku tych doświadczeń przedkłada się: \n● ludzie i interakcje ponad procesy i narzędzia \n● działające oprogramowanie ponad szczegółową dokumentację \n● współpracę z klientem ponad negocjacje umów \n● reagowanie na zmiany ponad realizację założonego planu \nWedług Manifestu agile docenia się to, co wymieniono po prawej stronie, jednak bardziej ceni się to, co po lewej."
   }
]