[
   {
      "nr": 1,
      "pytanie": "Wyjaśnij pojęcie bezrobocia oraz opisz jego rodzaje.",
      "odpowiedz": "Bezrobocie to zjawisko społeczne polegające na tym, że część ludzi zdolnych do pracy i pragnących ją podjąć nie znajduje zatrudnienia.\n\nIstnieje wiele rodzajów bezrobocia, z których najważniejsze to:\n\n* Bezrobocie frykcyjne (przejściowe, fluktuacyjne) - powstaje w wyniku terytorialnego lub zawodowego niedopasowania siły roboczej do popytu, wiąże się ono z ruchliwością pracowników (zmiana miejsca pracy, przechodzeniem na emeryturę).\n* Bezrobocie strukturalne - towarzyszy rozwojowi społeczno-ekonomicznemu, zwłaszcza wprowadzeniu innowacji techniczno-organizacyjnych oszczędzających pracę ludzką.\n* Bezrobocie nieefektywnego popytu - przyczyną jest niedostateczny popyt na pewne dobra.\n* Bezrobocie klasyczne (płacowe) - związane z wymuszaniem przez silne związki zawodowe nadmiernie wysokiego poziomu płac realnych.\n* Bezrobocie ukryte - utożsamiane z przerostami zatrudnienia, które wynikają zarówno z nadmiernego jak i nieracjonalnego zatrudnienia, np. niewykorzystanie czasu pracy itd.\n* Bezrobocie cykliczne (koniunkturalne) - związane z okresowymi spadkami koniunktury gospodarczej będącymi następstwem niedostatecznego popytu na dobra i usługi.\n* Bezrobocie technologiczne (czasem określane jako odmiana bezrobocia strukturalnego) - związane z substytucją pracy żywej przez postęp w technologii, techniki i organizacji pracy.\n* Bezrobocie sezonowe - polega na uzależnieniu rozmiaru bezrobocia od pory roku.\n* Bezrobocie jawne - zarejestrowane w urzędach pracy, dające łatwo się określić.\n\nDodatkowe kryteria podziału bezrobocia:\n\n* Czas trwania:\n    * Krótkookresowe - do 3 miesięcy\n    * Średniookresowe - od 3 do 6 miesięcy\n    * Długookresowe - od 6 do 12 miesięcy\n    * Chroniczne - ponad 12 miesięcy\n* Obszar badań:\n    * Globalne/powszechne (o charakterze międzynarodowym)\n    * Krajowe\n    * Regionalne (najczęściej obszar województwa)\n    * Lokalne\n* Opłacalność podjęcia pracy:\n    * Przymusowe - przy danym poziomie płac realnych byliby w stanie ją podjąć\n    * Dobrowolne - poszukujący pracy podjęliby ją przy wyższym poziomie płac realnych.\n"
   },
   {
      "nr": 2,
      "pytanie": "Wyjaśnij różnice między ekspansywną i restrykcyjną polityką fiskalną.",
      "odpowiedz": "Polityka fiskalna (budżetowa) to decyzje państwa dotyczące wydatków i podatków. Jej celem jest zaspokojenie popytu państwa na pieniądz.\nEkspansywna - pobudzanie gospodarki i wzrostu PKB\nRestrykcyjna - polityka zaciskania pasa\nZwiększenie wydatków rządowych lub/i zmniejszenie podatków (wzrasta dług publiczny)\nZmniejszenie wydatków rządowych lub/i zwiększenie podatków\nZwiększenie podaży pieniądza (obniżenie stopy dyskontowej, zakupy na otwartym rynku, obniżenie poziomu rezerw obowiązkowych)\nZmniejszenie podaży pieniądza (hamuje wzrostową tendencję wywołaną przez mechanizm rynkowy)\nProwadzona w czasie załamania gospodarczego i dna cyklu koniunkturalnego\nProwadzona w fazie ożywienia oraz szczytu cyklu koniunkturalnego\n"
   },
   {
      "nr": 3,
      "pytanie": "Wyjaśnij pojęcie wzrostu gospodarczego oraz wskaż jego źródła w długim okresie.",
      "odpowiedz": "Wzrost gospodarczy oznacza zwiększenie się poziomu realnego PNB (realny produkt narodowy brutto), który jest miarą całkowitego dochodu gospodarki narodowej.\nŚwiadczy on o ilości dóbr i usług, na których zakup może sobie pozwolić gospodarka jako całość.\nŹródła w długim okresie:\n- dostateczna podaż,\n- efektywność czynników wytwórczych,\n- handel zagraniczny,\n- postęp techniczny,\n- dynamika inwestycji.\n"
   },
   {
      "nr": 4,
      "pytanie": "Czym są rynek walutowy i kurs walutowy? Jaką rolę odgrywają w gospodarce?",
      "odpowiedz": "Rynek walutowy to rynek, na którym jedna waluta krajowa może być wymieniona na inną. Kurs walutowy (wymienny) to liczba jednostek waluty obcej, jaką można otrzymać za jednostkę waluty krajowej. Spadek (wzrost) kursu nazywamy deprecjacją (aprecjacją).\nTransakcje te spełniają 3 rodzaje funkcji: zabezpieczająca, spekulacyjna, płatnicza.\nRynek walutowy spełnia w gospodarce szereg istotnych funkcji:\n- porównywalność krajowych cen towarów, usług i instrumentów finansowych z zagranicznymi,\n- przyczynia się do rozwoju handlu zagranicznego poszczególnych krajów,\n- ma wpływ na międzynarodową wymianę handlową poprzez umożliwienie rozliczenia,\n- umożliwia dokonanie transferu siły nabywczej między krajem i zagranicą,\n- umożliwia połączenie krajowego rynku finansowego z międzynarodowym,\n- pozwala na prowadzenie polityki kursowej i monetarnej przez władze monetarne.\n"
   },
   {
      "nr": 5,
      "pytanie": "Wyjaśnij pojęcie produktu krajowego brutto oraz przedstaw jego składniki.",
      "odpowiedz": "Produkt krajowy brutto (PKB) to miara ekonomiczna, która określa wartość wszystkich dóbr i usług wytworzonych w danym kraju w określonym czasie, zazwyczaj rocznym. PKB jest szeroko używanym wskaźnikiem, który pomaga ocenić ogólny rozwój gospodarczy kraju oraz jego zdolność do generowania bogactwa.\n\nSkładniki PKB można podzielić na kilka głównych kategorii:\n\n- Konsumpcja prywatna: Obejmuje to wydatki krajowych gospodarstw domowych na dobra i usługi, takie jak żywność, ubrania, mieszkania, usługi komunalne, zdrowotne, transport oraz rekreacja.\n- Inwestycje: Dotyczy wydatków na inwestycje w kapitał trwały, takie jak zakup maszyn, wyposażenie, budowę nowych fabryk czy infrastrukturę. Inwestycje mogą być prowadzone zarówno przez sektor prywatny, jak i publiczny.\n- Wydatki rządowe: Obejmują wydatki administracji publicznej na cele takie jak edukacja, opieka zdrowotna, infrastruktura, obrona oraz inne programy publiczne.\n- Eksport netto: Różnica między wartością eksportu a importem. Jeśli wartość eksportu jest większa niż import, to mamy do czynienia z dodatnim eksportem netto, co przyczynia się dodatnio do PKB. W przeciwnym razie, gdy import przewyższa eksport, mamy ujemny eksport netto, co obniża PKB.\n\nMatematycznie PKB można wyrazić jako sumę tych składników:\n\nPKB = Konsumpcja prywatna + Inwestycje + Wydatki rządowe + (Eksport - Import)\n\nPKB stanowi ważne narzędzie do analizowania i porównywania gospodarek różnych krajów oraz monitorowania ich wzrostu gospodarczego. Jednakże, warto zauważyć, że PKB ma pewne ograniczenia i nie odzwierciedla pełnego obrazu dobrobytu społecznego czy jakości życia, dlatego używa się również innych wskaźników, takich jak Produkt Krajowy Brutto na mieszkańca, czy Indeks Rozwoju Społecznego.\n"
   },
   {
      "nr": 6,
      "pytanie": "Wymień i opisz etapy kształtowania się zespołu (tzw. cykl życia zespołu).",
      "odpowiedz": "1. Budowa i integracja - zespół dopiero powstaje (dobór odpowiednich osób). Jego członkowie poznają się, budują pozytywne relacje, tworzy się wzajemne zaufanie. Poznanie jasno sprecyzowane cele, zarówno każdego członka, jak i całego zespołu.\n2. Docieranie się - ujawniają się pierwsze różnice w osobowościach i oczekiwaniach poszczególnych osób (konflikty). Jest to zupełnie normalne. Po prawidłowym przejściu tej fazy, członkowie nauczą się akceptować i szanować wzajemne różnice oraz pojawią się pierwsze efekty synergii.\n3. Tworzenie synergii - najlepszy okres w życiu zespołu. Ludzie są zintegrowani i dotarci, zadania podzielone. Wszyscy dążą do wspólnego celu.\n4. Kryzys wieku średniego - pojawiają się pierwsze oznaki zmęczenia i znudzenia, motywacja jest obniżona. Ludzie uważają, że nie rozwijają się, a rutyna powoduje z czasem pierwsze symptomy wypalenia i obniżoną jakość działania.\n5. Odnowa i reintegracja lub równia pochyła - zespół przechodzi przez etap odnowy, gdzie podejmowane są działania mające na celu ponowne zintegrowanie i zmotywowanie członków, lub wchodzi w fazę upadku, gdzie problemy stają się coraz poważniejsze i zespół może się rozpaść.\n"
   },
   {
      "nr": 7,
      "pytanie": "Wymień i opisz warunki konieczne do efektywnego funkcjonowania zespołu.",
      "odpowiedz": "Efektywne funkcjonowanie zespołu zależy od wielu czynników. Oto kilka kluczowych warunków, które są konieczne do tego:\n\n1. Klarowne cele: Zespół musi mieć jasno określone cele, które są zrozumiałe dla wszystkich członków zespołu. Wspólne zrozumienie celów motywuje członków do współpracy i skupienia na osiągnięciu ustalonych rezultatów.\n\n2. Rola i odpowiedzialność: Każdy członek zespołu musi mieć jasno określoną rolę i odpowiedzialność. Klarowność w tym zakresie pomaga uniknąć nieporozumień oraz zapewnia, że każdy wie, czego od niego oczekuje się w ramach zespołu.\n\n3. Komunikacja i otwarta wymiana informacji: Efektywny zespół musi być oparty na otwartej i rzetelnej komunikacji. Członkowie zespołu powinni czuć się swobodnie w dzieleniu się swoimi myślami, pomysłami i obawami. Regularne spotkania i dostępność do informacji są kluczowe dla tego procesu.\n\n4. Zaufanie i szacunek: Zespół musi budować zaufanie i szacunek między członkami. Gdy członkowie zespołu ufają sobie nawzajem, łatwiej jest podejmować ryzyko, rozwiązywać konflikty i pracować wspólnie w trudnych sytuacjach.\n\n5. Różnorodność kompetencji i perspektyw: Efektywny zespół powinien składać się z osób o różnych umiejętnościach, doświadczeniach i perspektywach. Różnorodność ta pozwala zespołowi podejmować bardziej kreatywne i skuteczne decyzje, a także lepiej reprezentować różnorodne grupy interesów.\n\n6. Dobrze zdefiniowane procesy pracy: Zespół potrzebuje dobrze zdefiniowanych procesów pracy, które pomagają w organizacji zadań, podejmowaniu decyzji i monitorowaniu postępów. Jasne procedury i role ułatwiają efektywne zarządzanie projektem i zapobiegają chaosowi.\n\n7. Skuteczne zarządzanie konfliktami: Konflikty są nieuniknione w każdym zespole, ale ważne jest, aby zespół potrafił je konstruktywnie rozwiązywać. Skuteczne zarządzanie konfliktami obejmuje otwartą komunikację, empatię, zdolność do wysłuchania i wspólnego poszukiwania rozwiązań.\n\n8. Motywacja i zaangażowanie: Członkowie zespołu powinni być motywowani do osiągania wspólnych celów i zaangażowani w swoją pracę. Wsparcie ze strony lidera zespołu, możliwość rozwoju osobistego oraz docenianie osiągnięć są kluczowe dla utrzymania wysokiego poziomu motywacji i zaangażowania.\n"
   },
   {
      "nr": 8,
      "pytanie": "Podaj korzyści i słabości wynikające z pracy w zespole.",
      "odpowiedz": "Korzyści pracy w zespole:\n\n1. Zwiększona efektywność: Dzięki współpracy i podziale obowiązków zespół może osiągnąć cele szybciej i bardziej skutecznie niż jednostka pracująca samodzielnie.\n\n2. Różnorodność perspektyw: Zespoły składające się z różnorodnych osób mogą generować bardziej kreatywne pomysły i rozwiązania problemów poprzez połączenie różnych punktów widzenia i doświadczeń.\n\n3. Wzajemne wsparcie: Członkowie zespołu mogą wzajemnie wspierać się w trudnych sytuacjach, dzielić wiedzą i umiejętnościami oraz motywować się nawzajem.\n\n4. Rozwój umiejętności interpersonalnych: Praca w zespole może pomóc w rozwoju umiejętności interpersonalnych, takich jak komunikacja, negocjacje, zarządzanie konfliktami czy budowanie zaufania.\n\n5. Podział ryzyka: Dzięki współpracy w zespole, ryzyko związane z realizacją projektu lub zadania może być lepiej rozłożone między różnych członków, co zmniejsza presję na jednostkę.\n\nSłabości pracy w zespole:\n\n1. Konflikty interpersonalne: Różnice w punktach widzenia, osobowościach i stylach pracy mogą prowadzić do konfliktów w zespole, co może negatywnie wpływać na atmosferę i efektywność pracy.\n\n2. Decyzyjne opóźnienia: Proces podejmowania decyzji w zespole może być czasochłonny, zwłaszcza gdy istnieją różne opinie i perspektywy, co może opóźniać postęp prac.\n\n3. Brak indywidualnej odpowiedzialności: W niektórych przypadkach praca w zespole może prowadzić do utraty indywidualnej odpowiedzialności, co może obniżyć motywację jednostki do wykonywania swoich obowiązków.\n\n4. Dominacja jednostki: W niektórych zespołach jedna lub kilka osób może dominować nad resztą, co może prowadzić do poczucia wykluczenia innych członków zespołu oraz utrudniać współpracę.\n\n5. Zmniejszenie innowacyjności: Zbyt silna presja na konsensus i zgodność w zespole może ograniczać innowacyjność i kreatywność, ponieważ może to prowadzić do unikania ryzyka i utrzymywania status quo.\n"
   },
   {
      "nr": 9,
      "pytanie": "Określ pojęcie marketingu międzynarodowego.",
      "odpowiedz": "Marketing międzynarodowy to dział marketingu, który koncentruje się na promocji i sprzedaży produktów lub usług na rynkach zagranicznych. Obejmuje strategie i techniki, które firma stosuje w celu dotarcia do klientów poza swoim krajem pochodzenia. Marketing międzynarodowy uwzględnia różnice kulturowe, językowe, ekonomiczne, polityczne i prawne między różnymi krajami, aby skutecznie dostosować swoje działania do lokalnych warunków.\n\nPodstawowe zadania marketingu międzynarodowego obejmują:\n\n1. Badanie rynku: Analiza rynków zagranicznych w celu zrozumienia preferencji klientów, konkurencji, trendów rynkowych oraz czynników kulturowych i społecznych.\n\n2. Segmentacja rynku: Dzielenie rynków zagranicznych na segmenty o podobnych potrzebach, preferencjach i charakterystykach demograficznych w celu lepszego dopasowania oferty do potrzeb klientów.\n\n3. Pozycjonowanie marki: Tworzenie i promowanie unikalnego wizerunku marki na rynkach międzynarodowych, który wyróżnia ją spośród konkurencji i przyciąga klientów.\n\n4. Promocja i reklama: Opracowywanie kampanii promocyjnych, reklamowych i działań PR dostosowanych do lokalnych realiów kulturowych i językowych.\n\n5. Dystrybucja: Wybór odpowiednich kanałów dystrybucji, takich jak sprzedaż bezpośrednia, dystrybucja przez pośredników, e-commerce, które umożliwiają skuteczną dostawę produktów do klientów zagranicznych.\n\n6. Cena: Określanie strategii cenowej, uwzględniającej konkurencję, koszty transportu, cła, podatki oraz różnice w poziomie życia i siły nabywczej na rynkach międzynarodowych.\n"
   },
   {
      "nr": 10,
      "pytanie": "Przyczyny internacjonalizacji przedsiębiorstw.",
      "odpowiedz": "Internacjonalizacja przedsiębiorstw, czyli ich ekspansja na międzynarodowe rynki, może mieć wiele przyczyn. Oto kilka głównych:\n\n1. Dostęp do nowych rynków: Przedsiębiorstwa internacjonalizują się, aby uzyskać dostęp do nowych rynków i klientów. Rozszerzenie działalności poza granice krajowe może być kluczowe dla zwiększenia sprzedaży i zróżnicowania portfela klientów.\n\n2. Wzrost konkurencyjności: Internacjonalizacja może zwiększyć konkurencyjność przedsiębiorstwa poprzez wykorzystanie korzyści skali, zróżnicowania ryzyka oraz zdobycie przewagi konkurencyjnej na nowych rynkach.\n\n3. Dostęp do zasobów: Przedsiębiorstwa mogą internacjonalizować się, aby uzyskać dostęp do nowych źródeł surowców, technologii, wiedzy, kapitału ludzkiego czy nowych technologii.\n\n4. Optymalizacja kosztów produkcji: Czasami internacjonalizacja pozwala przedsiębiorstwom na zminimalizowanie kosztów produkcji poprzez przeniesienie produkcji do regionów o niższych kosztach pracy lub korzystanie z korzyści skali w globalnych sieciach dostaw.\n\n5. Unikanie ograniczeń rynkowych: Internacjonalizacja może być reakcją na ograniczenia na rynku krajowym, takie jak nasycenie rynku, regulacje, polityka fiskalna czy handlowa.\n"
   },
   {
      "nr": 11,
      "pytanie": "Przedstaw analizę PEST.",
      "odpowiedz": "Analiza PEST (generalna segmentacja otoczenia) jest metodą służącą do badania makrootoczenia.\nOkreśla podstawowe sfery (obszary) mające kluczowy wpływ na funkcjonowanie organizacji:\n\nCzynniki polityczno – prawne (POLITICAL):\n- Ustawodawstwo antymonopolowe,\n- Przepisy o ochronie środowiska,\n- Polityka podatkowa,\n- Przepisy dotyczące handlu zagranicznego,\n- Prawo pracy,\n- Stabilność władzy.\n\nCzynniki ekonomiczne (ECONOMIC):\n- Cykle koniunktury gospodarczej,\n- Tendencje w zakresie PKB,\n- Stopy procentowe,\n- Podaż pieniądza,\n- Inflacja,\n- Bezrobocie,\n- Dostępność i koszt nośników energii,\n- Kursy walut,\n- Rentowność przedsiębiorstw.\n\nCzynniki społeczno – kulturowe (SOCIAL):\n- Demografia ludności,\n- Rozłożenie dochodów,\n- Normy etyczne i moralne,\n- Zmiany stylu życia,\n- Konsumpcyjny styl życia,\n- Poziom wykształcenia.\n\nCzynniki technologiczne (TECHNOLOGICAL):\n- Wydatki państwa na badania i rozwój,\n- Poziom technologiczny kluczowych sektorów,\n- Innowacyjność technologiczna,\n- Szybkość transferu technologii.\n\nPoprzez dogłębną analizę wyznacza przyszłą strategię działania organizacji."
   },
   {
      "nr": 12,
      "pytanie": "Finansowe czynniki wartości przedsiębiorstwa.",
      "odpowiedz": "Wartość przedsiębiorstwa jest wynikiem wielu czynników, z których wiele ma bezpośredni związek z jego sytuacją finansową.\n\n1. Przychody: Stabilne i rosnące przychody są istotnym czynnikiem wpływającym na wartość przedsiębiorstwa. Wyższe przychody zazwyczaj oznaczają większy potencjał generowania przyszłych zysków.\n\n2. Zysk netto: Zysk netto to różnica między przychodami a kosztami operacyjnymi oraz podatkami. Wyższy zysk netto zazwyczaj oznacza większą wartość przedsiębiorstwa, ponieważ odzwierciedla on zdolność firmy do generowania zysków.\n\n3. Dochód operacyjny: Dochód operacyjny to zysk przed opodatkowaniem oraz odsetkami i amortyzacją (EBITDA). Wyższy dochód operacyjny świadczy o efektywnym wykorzystaniu zasobów firmy i może dodatkowo podnosić jej wartość.\n\n4. Dług i zadłużenie: Poziom zadłużenia ma istotny wpływ na wartość przedsiębiorstwa. Wysokie zadłużenie może zwiększać ryzyko finansowe i obniżać wartość firmy ze względu na koszty obsługi długu oraz ograniczenia finansowe.\n\n5. Płynność finansowa: Wysoki poziom płynności finansowej, czyli dostępność gotówki i aktywów łatwo zamienialnych na płynne środki pieniężne, może dodatkowo podnosić wartość przedsiębiorstwa, zapewniając stabilność finansową i zdolność do realizacji inwestycji.\n\n6. Wartość rynkowa akcji: Wartość rynkowa akcji przedsiębiorstwa na giełdzie lub w transakcjach prywatnych może być ważnym wskaźnikiem wartości firmy, ponieważ odzwierciedla postrzeganie jej przez inwestorów.\n\n7. Aktywa i zobowiązania: Skład aktywów i zobowiązań, w tym ich jakość i stopień zabezpieczenia, również mogą wpływać na wartość przedsiębiorstwa. Bogatsza i lepiej zabezpieczona baza aktywów może podnosić wartość firmy.\n\n8. Prognozy przyszłych przepływów pieniężnych: Oczekiwane przyszłe przepływy pieniężne są kluczowym czynnikiem, który inwestorzy biorą pod uwagę przy ocenie wartości przedsiębiorstwa. Prognozy te uwzględniają m.in. wzrost przychodów, zmiany kosztów i inwestycje przyszłościowe."
   },
   {
      "nr": 13,
      "pytanie": "Cele analizy strategicznej przedsiębiorstwa.",
      "odpowiedz": "1. Identyfikacja szans i zagrożeń generowanych przez otoczenie w kontekście dalszego rozwoju firmy.\n2. Identyfikacja silnych i słabych stron pod kątem możliwości budowania przewagi konkurencyjnej.\n3. Konfrontacja (bilans) szans i zagrożeń tkwiących w otoczeniu oraz silnych i słabych stron przedsiębiorstwa w celu zdefiniowania wariantów strategii rozwoju, a w konsekwencji planów i programów strategii zarządzania.\n4. Możliwe wczesne wykrycie nieprawidłowości w funkcjonowaniu samego przedsiębiorstwa oraz ich przyczyn.\n5. Samookreślenie przedsiębiorstwa i ustalenie jego miejsca na rynku w relacji do głównych konkurentów (ocena tożsamości i wizerunek firmy).\n6. Ogólna ocena ryzyka związanego z prowadzeniem poszczególnych rodzajów działalności; określenie możliwości tworzenia wartości dodanej dla klientów i innych interesariuszy."
   }
]